[
	{
		"name": "Asparagus",
		"imgUrl": "https://www.rhs.org.uk/getmedia/fb1ff534-6cd5-4c3c-b9d3-1fe6c59a999f/Asparagus_PUB0028089.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [null, null, "Plant", "Harvest", "Harvest", "Harvest"],
		"desc": "Asparagus is easy to grow, producing tasty new shoots from mid-spring to early summer – a seasonal treat to be savoured.  These large perennial plants need to be grown in the ground, rather than in containers, where they will crop annually for many years.  However, new plants take a couple of years to settle in before you can start harvesting, so patience is required initially. \n Asparagus is usually grown from crowns, but can also be grown from seed, these plants take one year longer before you can start cropping – three years as opposed to two years grown from crowns. \nIt is best to choose an all-male F1 hybrid cultivar, as these tend to produce better and stronger spears.  Non-hybrid seeds produce female as well as male plants, and these will in turn produce seedlings that will need to be weeded out to prevent competition with the existing plants.  Even F1 all-male seeds can produce the occasional female plant. \n\nSow seeds indoors in February at 13–16°C (55–61°F).  Sow them singly into modules filled with seed compost.  Harden them off and transplant into their final positions in early June.  Prepare the planting site by weeding thoroughly, then dig in at least one bucketful of organic matter, such as garden compost or well-rotted farmyard manure, every square metre/yard. \n\nAlternatively, sow outside in March or April, in drills 2. 5cm (1in) deep and 30–45cm (12–18in) apart.  Thin the seedlings to 15cm (6in) apart and protect from slugs and snails.  Transplant them to their final positions the following March. To grow well, asparagus plants should be fed well and kept weed free.  Plants may need supporting as they grow quite tall, and should be cut down at the end of the season.  Keep the asparagus bed weed- free, as asparagus plants grow better without competition from weeds.  Weed by hand rather than with a hoe, as they have shallow roots that are easily damaged. \nIf you have any female plants (which produce orange-red berries), you will need to weed out any seedlings.  If you’re growing an all-male cultivar, remove any female plants that appear. Mulch the bed in late winter to discourage weeds and hold moisture in the soil.  Consider covering the bed from autumn to winter with a weed-suppressing membrane to prevent annual weeds germinating. In early spring, apply 100g per sq m (3oz per sq yd) of general fertiliser such as Growmore, or blood, fish and bone.  If growth is weak, repeat this application once harvesting has finished. Asparagus grows into a tall, feathery plant over the summer.  To avoid the stems breaking in windy weather and damaging the crown, support plants using stakes and twine to make a ‘fence’ either side of the row. In autumn, allow the foliage to turn yellow before cutting it down to soil level. To make more plants, you can divide well-established crowns in late winter or early spring.  Do this no more than every three years, as asparagus plants can be slow to settle back in afterwards.  Dig up the crown, handling it carefully.  Gently prise it apart into several smaller sections, each with several growing points, taking the strongest parts from the edge of the crown.  It may be necessary to cut some roots if they can’t be pulled apart.  Discard any old, woody parts.  Replant the new sections straight away (see Sow and plant, above), with the buds visible at the soil surface. Asparagus are usually grown from dormant roots, called crowns, available in garden centres and online.  Plants are either male or female – male plants produce more and better spears, so many modern cultivars are all-male.  \n\nThere are several varieties to choose from, producing different flavours, colours or sizes of shoots, and sometimes only male plants. \n\nLook in particular for varieties with an RHS Award of Garden Merit (AGM), which shows they performed well in trials, so should grow and crop reliably – see our list of AGM fruit and veg. Asparagus is usually planted as one-year-old, dormant plants called crowns.  These are widely available in garden centres and from online suppliers in spring.  They should be planted straight away, ideally in March.  Plant them a dedicated asparagus bed, rather than mixing them with other crops.  \n\nIt’s best to choose a planting site in full sun, but asparagus will also tolerate dappled shade.  Most soil types are suitable, as long as they are well drained.  On heavy soils, consider creating raised beds.  A pH of 6. 5–7. 5 is ideal, so more acidic soils may need liming. \n\nWhen planting asparagus, choose fresh ground to avoid any build-up of pests – don’t replant an old asparagus bed with new asparagus plants. \n\nWeed the ground thoroughly before planting, and dig in at least one bucketful of organic matter, such as garden compost or well-rotted farmyard manure, every square metre/yard. \n\nThen dig a trench 30cm (1ft) wide and 20cm (8in) deep.  Fork garden compost or well-rotted manure into the base of the trench and cover with a 5cm (2in) layer of the excavated soil.  Make a ridge of soil, 10cm (4in) high, along the centre of the trench. \n\nPlace the crowns on top of this ridge, with the growing points or new shoots uppermost, spacing plants 30–45cm (12–18in) apart.  Spread the roots out evenly, but handle carefully as they break easily.  Mix organic matter into the excavated trench soil, gently return this enriched soil back into the trench, leaving the bud tips just visible.  Space rows 45cm (18in) apart and stagger the plants between adjacent rows. \n\nWater in, then mulch with a 5cm (2in) layer of well-rotted manure or garden compost to help supress weeds which can be a problem. Resist the temptation to harvest newly planted asparagus for the first two years, to let plants get well established.  In the third year, harvest spears from mid-April for six weeks.  In subsequent years, you can harvest for eight weeks from mid-April. \n\nTo harvest, cut individual spears with a sharp knife 2. 5cm (1in) below the soil surface when they are no more than 18cm (7in) tall.  In warm weather, harvest every two to three days for the best quality spears. Asparagus is generally easy to grow and crops reliably every spring.  However, there are a few pests that can damage plants and lead to reduced harvests, the principal culprits being slugs, snails and asparagus beetles.  Frost can also damage young shoots in spring, and plants are prone to rotting in damp soil. \n These feed on the young seedlings and you'll see the tell tale slime trail on the soil around your crop, as well as on the leaves. There are many ways to control slugs and snails, including beer traps, sawdust or eggshell barriers, copper tape and biocontrols. Adult beetles and their larvae strip the outer bark and leaves from the stem.  Damaged areas become yellow-brown and dessicated.  The black beetles are 6-8mm long with a red thorax and six yellow blotches on the wing cases.  Larvae are grey-black in colour, 1cm (½in) long, with three pairs of legs. Destroy overwintering beetles by burning old stems at the end of the season.  From late spring, search and destroy the pests by hand. Late frosts can damage growth, leading to it dying or being distorted. Remove any damaged growth and protect the bed with a double layer of horticultural fleece if frost is forecast"
	},
	{
		"name": "Aubergines",
		"imgUrl": "https://www.rhs.org.uk/getmedia/e19756b6-1f14-4495-8444-250d249b54d8/aubergine_PUB0021090.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [
			"Sow",
			"Sow",
			"Sow",
			"Sow",
			"Plant",
			"Plant",
			"Harvest",
			"Harvest"
		],
		"desc": "Aubergines are becoming increasingly popular, with the introduction of new cultivars with smaller fruits that crop more readily.  Sunshine and warmth are the keys to success, so these tender plants do best in a greenhouse.  Sow seeds early in the year in warm conditions indoors – even in an airing cupboard. Sow in pots or modules filled with seed compost from February onwards.  If the plants will be growing in a heated greenhouse, you can start them earlier, in January.  If they will be growing outdoors, delay sowing indoors until early March, as these tender plants mustn’t be moved outside until after the last frost.  \n\nKeep the pots or modules at 18–21°C (65–70°F), either in a heated propagator or a warm location indoors. \n\nIf germinating seeds in an airing cupboard, check daily and remove as soon as seedlings appear.  Then place on a warm, bright windowsill. If you don’t have room to grow from seed indoors, young aubergine plants are now widely sold in garden centres in spring.  Grafted plants are also available – these grow strongly and usually cope better with cooler conditions outdoors. Aubergines need a lot of warmth and sun to crop well, so are best grown in a greenhouse.  They can be grown outside, but rarely do well except in mild areas or very warm summers. Grow initially in 9cm (3½in) pots, then when the roots fill the pot, transfer to 23cm (9in) pots at the following times:in April if growing in a heated greenhousein early May if growing in an unheated greenhousein late May/early June if they will be growing outdoors\n\t Aubergines can also be planted in the ground in warm areas of Britain: Choose your warmest, sunniest, most sheltered position, ideally against a sunny wall. Warm the soil with polythene or cloches two weeks before planting, once there is no danger of frostSpace plants 60cm (2ft) apartCover young plants with cloches or fleece for a further two weeks until acclimatised\n\t Plants need staking, as they can grow tall and top-heavy.  Tie in the main stem as it growsWhen plants are 30cm (1ft) high, pinch out the tip of the main stem, to encourage sideshootsWater regularly and feed with a high potassium liquid fertiliser every two weeks once the first fruit starts to formMist the leaves regularly (at least twice daily) with tepid water to discourage red spider mites and improve fruitingRemove any further flowers once five or six fruits have started to form – cultivars that produce small or round fruits can be allowed to produce many moreHarvest fruits individually as soon as they are ripe, with a glossy skin – usually from August onwards. Leaves become mottled, pale and covered in webbing, on which the mites can be clearly seen; leaves also drop prematurely. They thrive in hot, dry conditions, so mist plants regularly.  Use biological control in the greenhouse. Small white flies suck sap and excrete sticky ‘honeydew’ over the plant, encouraging the growth of sooty mould. Use biological control or sticky traps in the greenhouse. Look for colonies of greenfly on the soft shoot tips of plants or on leaves.  They suck sap and excrete sticky honeydew, encouraging the growth of black sooty moulds. Use your finger and thumb to squash aphid colonies or use biological control in the greenhouse. Masterchef judge Greg Wallace shares his recipe for grilled vegetable terrine"
	},
	{
		"name": "Beetroot",
		"imgUrl": "https://www.rhs.org.uk/getmedia/895fa789-6e9c-45d9-90d6-87f8d0e30fa7/Harvesting-baby-beetroot_PUB0002432.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [
			null,
			null,
			"Sow",
			"Sow",
			"Sow",
			"Harvest",
			"Harvest",
			"Harvest"
		],
		"desc": "Beetroot are easy to grow, take up little space and are ideal for beginners.  They’re also nutritious, delicious and versatile.  Sow seeds little and often, for continuous cropping, harvesting when the roots are young, tender and the size of a golf ball.  If you grow varieties for winter storage, it’s possible to have beetroot almost all year round. Sow three seeds at 10cm (4in) spacings, 2. 5cm (1in) deep, in rows 30cm (1ft) apart. \n\nSow small batches at fortnightly intervals from March or April to July for a succession of tender, tasty roots. Choose bolt-resistant varieties for early sowings under cloches or fleece in late February or early March.  You can sow without protection from late March onwards.  \n\nBeetroot sown from June onwards can be stored for use in winter.  Beetroot grows best in fertile, well-drained soil.  \n\nPrior to sowing, dig in a bucketful of well-rotted garden compost or other organic matter.  Then rake in a handful per square metre/yard of Growmore or other general-purpose fertiliser. When the seedlings are about 2. 5cm (1in) high, thin out to leave one every 10cm (4in). During dry spells, water every 10–14 days. \n\nIf plants aren’t growing strongly, apply high nitrogen fertiliser (30g/1oz per sq m/yd), such as sulphate of ammonia, and water in. Beetroot can also be grown in containersBeetroot can be harvested from early summer through to mid-autumn, depending on sowing time and variety. \n\nPull up alternate plants once the roots are golf ball size, leaving the rest to reach maturity if you wish.  Harvest these when no larger than a cricket ball. Plants flower and set seed prematurely. Unless growing for seed sow bolt-resistant varieties.  Sow or plant at the correct time and keep the soil or compost moist"
	},
	{
		"name": "Broad beans",
		"imgUrl": "https://www.rhs.org.uk/getmedia/10312c22-d4f8-46fe-96db-a5df90b08f98/Broad_bean_PUB0002070.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [null, "Sow", "Sow", "Sow", "Harvest", "Harvest"],
		"desc": "Broad beans are easy to grow and low maintenance, providing crops from May onwards.  Picked fresh, young beans taste sensational – sweet, tender and succulent.  If you’re short on space, there are even dwarf varieties that can be grown in containers. Broad beans can be sown in pots under cover from February onwards, for planting out in spring.  This method is especially useful where soils are wet or rich in clay (which can lead to seeds rotting in the ground), or if mice are a problem in your garden, as they tend to eat direct-sown seeds. \nSow the large seeds individually into small pots or modular trays filled with seed compost, inserting them 5cm (2in) deep.  Water well and keep in good light. Broad beans are easy to sow direct into the ground in March, April and even early May, for harvests throughout the summer.  Sowing in November or February is also possible in milder parts of the UK or very sheltered sites, especially those with well-drained soil.  Use a hardy variety and protect young plants with fleece or cloches during cold spells. \n\nChoose a sunny, sheltered growing site with well-drained soil.  Weed thoroughly, then fork in plenty of garden compost or well-rotted manure, and water well. \n\nSow seeds 5–7. 5cm (2–3in) deep and 15–23cm (6–9in) apart, depending on the cultivar.  In open ground, sow in single rows 45cm (18in) apart or double rows 23cm (9in) apart with 60cm (2ft) between each double row.  In raised beds, where space is not needed to walk between rows for picking, all rows can be spaced 23cm (9in) apart. \n\nIt is also worth sowing a few extra seeds at the end of the rows to produce extra plants that can be lifted and moved to fill any gaps left by seeds that fail to germinate. \n\nDwarf varieties can also be sown in large containers filled with multi-purpose or loam-based compost and positioned in a sunny, sheltered spot. Unless rainfall has been high, soak plants well at the start of flowering and again two weeks later.  Regular watering may be needed on light, free-draining soil. \n\nDwarf plants in containers require regular watering throughout the growing season, as they dry out more quickly than plants in the ground. Tall cultivars may need staking – insert sturdy stakes at each corner of the rows and every 1. 2m (4ft) along the rows.  Run string around the stakes at 30cm (1ft) intervals from the ground.  Smaller cultivars usually support each other, especially when planted in double rows. When the lowest truss of flowers has formed small pods, pinch out the plant’s shoot tips to encourage fruiting and reduce problems with blackfly (see Common problems, below).  These tips are delicious steamed or stir-fried. Hoe regularly to remove weeds as soon as they appear. Broad beans can be ready to pick from late spring to mid-summer, depending on the sowing time and variety. \n\nYou can pick young immature pods when they are 7. 5cm (3in) long and cook them whole. \n\nWhen picking pods to shell, wait until the beans are visible through the pod.  But don’t leave them too long – the scar on the bean should still be white or green, not black, as the beans will become tough at this stage.  Small beans are sweeter and more tender that large ones.  Regular picking encourages further pods to form. \nCheck plants regularly, as pods can ripen fast.  Pods lower down the plant will mature first. Several pests, diseases and disorders can affect broad beans, but these robust plants are rarely severely damaged and usually still produce a good crop.  These rodents will eat the seeds where plantedTrapping can be effective for mice in a garden situation, although voles can be harder to control.  Break-back traps of the type used against house mice can be effective when set in places where damage is occurring.  Pieces of carrot or dessert apple are effective baits for voles, and peanut butter for mice.  When using traps or baits out of doors, they must be placed under covers to reduce the risk of other animals interfering with them.  Birds are particularly vulnerable to accidental trapping. Sap-sucking aphids will disfigure plants and cause stunting to leaves and stems. In the case of broad beans, pinch out infested tips.  On other beans, catch populations when small and squash. Common on overwintering plants or in damp, humid weather, this fungal disease causes brown spots on leaves and brown streaks on stems and pods. Ensure there is good air flow around plants by spacing them correctly and keeping the ground weed free. This tiny insect bites tiny U-shaped holes from around the outside of the leaf, resulting in a distinctive scalloped appearance. Although unsightly, damage is unlikely to have an impact on the harvest.  Covering with fleece will boost growth and exclude the weevils. Nigel Slater uses young broad beans to make a delicious light lunch of broad beans in their pods with dill and yoghurt"
	},
	{
		"name": "Broccoli",
		"imgUrl": "https://www.rhs.org.uk/getmedia/59f5a144-3b58-4ef5-b3d5-660552fbf560/Brassica-oleracea-Italica-Group_ADV0000521.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [
			null,
			"Harvest",
			"Harvest",
			"Harvest",
			"Sow",
			"Harvest",
			"Harvest",
			"Harvest"
		],
		"desc": "Broccoli is popular for its high vitamin content and anti-cancer agents.  It’s a fast and easy-to-grow crop, producing bluish-green heads for harvesting in summer or autumn.  Sprouting broccoli – white or purple – is hardy and overwinters outdoors for harvesting in spring, filling the gap between Brussels sprouts and spring cabbages. Seeds are generally sown between March and June.  Until April, sow in modular trays, two seeds per module, in a greenhouse or indoors, then from April sow outdoors. \n\nAfter germination, thin out the seedlings, removing the smaller or weaker one to leave one per module. Apply a general purpose liquid feed every week. \n\nWhen the young plants are 10–15cm (4–6in) tall with a good rootball, plant them outside into fertile soil in sun or very light shade. \n\nPrepare the ground by adding a high potassium general fertiliser, such as Vitax Q4, at a rate of three handfuls per square metre/yard.  Alternatively, if well-rotted manure or garden compost has been dug in, use half the amount of fertiliser. Space plants 30cm (1ft) apart, with 45cm (18in) between rows.  Closer spacing will reduce the number of sideshoots, leading to a smaller crop. From April, seeds can be sown outdoors where the plants are to grow.  Sow three seeds, 2cm (¾in) deep, every 30cm (1ft) along the row. \n\nControl slugs and snails as they will quickly devour seedlings. \n\nWhen the seedlings are large enough to be handled, thin out each ‘station’, leaving one healthy seedling every 30cm (1ft). Broccoli grows best in fertile, well-drained, moisture-retentive soil, in full sun or very light shade. \n\nCover seed beds and newly transplanted indoor-raised plants with fleece to exclude cabbage root fly.  You can remove it in May, when the risk of damage is reduced. Water broccoli every 10–14 days in dry weather. \n\nWhen plants about 20cm (8in) tall, add a high nitrogen fertiliser, such as sulphate of ammonia, at 35g (1oz) per square metre/yard. ,Birds can be a problem, so net the plants when heads are starting to form. \n\nBetter heads are produced in cooler summers, as hot weather can encourage plants to go to seed prematurely – some cultivars resist this tendency better than others (see Recommended Varieties below). Regular sowings of broccoli can provide crops from late winter through to autumn, depending on sowing time and variety.  Plants generally take two or three months to start cropping, then provide pickings for about a month. \n\nBroccoli is ready to harvest when the heads or spears are well formed but still in bud, before individual flowers begin to open. \n\nCut the central spear first.  This is followed by a series of smaller spears on the sideshoots, which can be picked regularly over four to six weeks. Birds, especially pigeons, can cause an array of problems including eating seedlings, buds, leaves, fruit and vegetables. Protect the plants from birds by covering them with netting or fleece.  Scarecrows and bird-scaring mechanisms work for a while, but the most reliable method of protection is to cover plants with horticultural fleece or mesh. A number of caterpillars will feed on brassicas, but the most common are those of cabbage white butterflies.  You will usually see the caterpillars, if not, you will see the holes they make in the leaves.  They will also bore into the heart of cabbages. In mild attacks, or if you have only a few plants, you may be able to pick the caterpillars off.  Insect-proof mesh or fine netting (5-7mm mesh) can prevent egg-laying. Roots become swollen and distorted, and leaves become pale and yellow and wilt easily.  Plants may die. Improve drainage and add lime to make soil more alkaline.  Do not grow in affected soil. White larvae approximately 5cm (2in) long, feed on the roots just below the soil surface, stunting growth and causing plants to wilt and die. Grow under insect-proof mesh or horticultural fleece.  Seedlings are most vulnerable. This recipe for purple sprouting broccoli with anchovy dressing is perfect to serve as a main meal or as a side vegetable dish, and can be eaten all year round"
	},
	{
		"name": "Brussels sprouts",
		"imgUrl": "https://www.rhs.org.uk/getmedia/47aadc6a-0219-438d-88d9-83ecb59fa837/Brassica-oleracea-(Gemmifera-Group)-Stan-_WSY0025698.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [
			"Harvest",
			"Harvest",
			"Harvest",
			"Sow",
			null,
			null,
			"Harvest",
			"Harvest"
		],
		"desc": "Brussels are a stalwart among winter vegetables and a traditional festive favourite.  They have the best flavour when harvested after being frosted – superior to anything you can buy in the supermarket. Sow under cloches or fleece, or in a coldframe, from early March to early April.  Start them off early to get the best crop. \n\nUse early, mid-season and late cultivars, to provide a long cropping season. \n\nFor an early crop, sow in a greenhouse in small pots or modular trays in February, for harvesting from August. \n\nBrussels are traditionally sown in a separate seed bed, rather than on the main veg plot, then transplanted in early summer, once more space is available.  \n\nSow seeds thinly, 13mm (½in) deep, in rows 15cm (6in) apart.  Thin seedlings to 7. 5cm (3in) apart once they are large enough to handle. \n\nGrow in pots if clubroot is a problem.  From mid-May to early June, when the young plants are 10–15cm (4–6in) tall and have seven true leaves, transplant them to their final growing position:\n Choose a sunny site, sheltered from strong windsImprove the soil by adding up to two bucketfuls of well-rotted manure per square metre/yard, and a high potassium general fertiliser, such as Vitax Q4, at a rate of three handfuls per square metre/yard. Water the plants well before moving them, and again afterwardsSpace them 60cm (2ft) apart, with 75cm (2½ft) between rows  \nWater the plants regularly until they have settled in.  Then water in dry weather, repeating every 10–14 days. \n \nIn July, apply a top-dressing of nitrogen-rich fertiliser, such as dried poultry manure pellets (150g/5oz per square metre/yard). \n \nIn September, mound soil around the base of the stems, to provide extra support. Early varieties can be harvested from August.  With later cultivars, the flavour is improved once the sprouts have been frosted. \n\nStart picking the lowest sprouts first, when they are the size of a walnut, firm and still tightly closed.  Snap them off with a sharp downward tug. \n\nAt the end of the season, the sprout tops can be harvested too. Roots become swollen and distorted, and leaves become pale and yellow and wilt easily.  Plants may die. Improve drainage and add lime to make soil more alkaline.  Do not grow in affected soil. Birds, especially pigeons, can cause an array of problems including eating seedlings, buds, leaves, fruit and vegetables. Protect the plants from birds by covering them with netting or fleece.  Scarecrows and bird-scaring mechanisms work for a while, but the most reliable method of protection is to cover plants with horticultural fleece or mesh. White larvae approximately 5cm (2in) long, feed on the roots just below the soil surface, stunting growth and causing plants to wilt and die. Grow under insect-proof mesh or horticultural fleece.  Seedlings are most vulnerable. A number of caterpillars will feed on brassicas, but the most common are those of cabbage white butterflies.  You will usually see the caterpillars, if not, you will see the holes they make in the leaves.  They will also bore into the heart of cabbages. In mild attacks, or if you have only a few plants, you may be able to pick the caterpillars off.  Insect-proof mesh or fine netting (5-7mm mesh) can prevent egg-laying"
	},
	{
		"name": "Cabbages",
		"imgUrl": "https://www.rhs.org.uk/getmedia/3c00ea55-b6e8-4404-89f9-600e5238b273/Cabbage_MAR0005357.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [
			"Harvest",
			"Harvest",
			"Harvest",
			"Harvest",
			"Harvest",
			"Harvest",
			"Harvest",
			"Harvest"
		],
		"desc": "Easy to grow, nutritious and tasty, cabbages are veg plot favourites.  There are many different types, in various shapes, sizes and colours, for harvesting at all times of the year.  You can use them raw in salads or coleslaw, and as ingredients in many delicious dishes, from hearty soups to traditional bubble and squeak.  Cabbages can be sown either directly in the ground outside or in modular trays (and left outdoors).  If you only want a few cabbages or have limited space, it’s easiest to sow in trays (one seed per module), then transplant outdoors later.  Although cabbages do best in open ground, you could grow one or two in a large, deep container, but they aren’t suitable for growing bags. \n\nTake care not to grow cabbages in the spot where you grew them (or other brassicas) the previous year. Traditionally, cabbages are sown into a ‘seed bed’ – a site away from the main vegetable plot – then transplanted later in the season.  This is because sowing them at their final spacing in your main plot would take up a lot of room early in the season, when you could be using it for fast-maturing crops such as lettuces. Still, if you have plenty of space, it’s fine to sow straight into your main plot at their final spacing – 30–45cm (12–18in) apart, depending on the variety (check individual seed packets). All the groups of cabbages are grown in exactly the same way, just the sowing times vary:Summer cabbages: sow from late February/early March (under cloches or similar cover) until early May; transplant in May/JuneWinter cabbages: sow in April/May; transplant in late June/July​​Spring cabbages: sow in July/August; transplant in September/OctoberCabbages need a sunny site and firm soil.  If possible, prepare the ground in autumn by adding plenty of well-rotted manure or garden compost, then leave it over winter to consolidate. \n\nBefore sowing, make sure the soil is well firmed by shuffling along the surface on your heels.  Then rake it level, creating a fine, crumbly texture. \n \nMake a drill, 1cm (½in) deep, then sow the seeds thinly along it. \n When your young cabbage plants have five or six true leaves, it’s time to transplant them to their final growing position. \n\nThe method is simple:Water them well the day before Set the plants in their new hole so the lowest leaves are at ground level‘Puddle’ in the plants with plenty of water – this means filling the hole with water several times before adding soil\nThe spacing varies depending on the type of cabbage:Compact varieties – 30cm (1ft) apartLarger varieties – up to 45cm (18in) apartSpring cabbages – just 10cm (4in) apart, in rows 30cm (1ft) apart, then thin out to 30cm (1ft) apart in late February/MarchWater plants in prolonged dry spells – a thorough soak every 10 days should be enough.  When the heads begin to form, generous watering will greatly improve size. \n\nFeed summer and winter cabbages with a high-nitrogen fertiliser before they get too big. Sowings of spring, summer and winter varieties can provide cabbages throughout the year.  They generally take about four to six months to reach maturity, depending on the type.  \n\nHarvest them once they have reached the size you want, and formed a firm head.  Cut through the stem just above ground level with a sharp knife. \n\nIf you cut a 1cm (½in) deep cross in the stump of spring and summer cabbages after harvesting, they should go on to produce a second (much smaller) cabbage. White larvae approximately 5cm (2in) long, feed on the roots just below the soil surface, stunting growth and causing plants to wilt and die. Grow under insect-proof mesh or horticultural fleece.  Seedlings are most vulnerable. A number of caterpillars will feed on brassicas, but the most common are those of cabbage white butterflies.  You will usually see the caterpillars, if not, you will see the holes they make in the leaves.  They will also bore into the heart of cabbages. In mild attacks, or if you have only a few plants, you may be able to pick the caterpillars off.  Insect-proof mesh or fine netting (5-7mm mesh) can prevent egg-laying. Roots become swollen and distorted, and leaves become pale and yellow and wilt easily.  Plants may die. Improve drainage and add lime to make soil more alkaline.  Do not grow in affected soil. These feed on the young seedlings and you'll see the tell tale slime trail on the soil around your crop, as well as on the leaves. There are many ways to control slugs and snails, including beer traps, sawdust or eggshell barriers, copper tape and biocontrols. Nigel Slater combines cabbage with garlic, ginger and spring onions in this Thai-style brassica stir-fry"
	},
	{
		"name": "Calabrese",
		"imgUrl": "https://www.rhs.org.uk/getmedia/13ed29f6-57d6-4eeb-85d5-1a243ca152b5/calabrese-express-940x627.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [
			null,
			null,
			"Sow",
			"Plant",
			"Plant",
			"Plant",
			"Harvest",
			"Harvest"
		],
		"desc": "Calabrese is a very easy, fast-growing crop, also known as American, Italian or green sprouting broccoli.  Reaching 60cm (2ft) tall, it produces bluish-green heads up to 15cm (6in) across that are harvested in summer or autumn, depending on sowing time. Seeds are generally sown between February and June – indoors from late winter into spring, then outdoors through to early summer. From Febuary to April, start seeds off in a greenhouse or indoors.  Sow into a modular tray filled with seed compost, two seeds per module.  As soon as the seedlings are large enough to be handled, thin to one per module.  Give them a general purpose liquid fertiliser every week. From April, sow in the ground where the crop is to grow.  Choose a sunny or very lightly shaded spot, with fertile, well-drained soil. \n\nSow three seeds, 2cm (¾in) deep, every 30cm (1ft) along the row.  When the seedlings are large enough to handle, thin out to leave just one healthy seedling every 30cm (1ft). \nCover the plants with fleece to exclude cabbage root fly, removing it in May when the risk of damage lessens. Water every 10–14 days during dry periods. \n\nWhen plants are about 20cm (8in) tall, apply a high nitrogen fertiliser, such as sulphate of ammonia, at 35g (1oz) per square metre/yard.  \n\nBetter heads are produced in cooler summers, as hot weather can encourage plants to go to seed prematurely – some cultivars resist this tendency better than others. When indoor-raised plants have formed a good rootball, transplant them out into fertile soil in full sun or very light shade. \n\nPrepare the ground by adding a high potassium general fertiliser, such as Vitax Q4, at a rate of three handfuls per square metre/yard.  If the soil has been enriched with garden compost or well-rotted manure, use only half the amount of fertiliser. \n\nSpace plants 30cm (1ft) apart, with 45cm (18in) between rows.  Closer spacing will reduce the number of side-shoots produced.  Calabrese can be harvested from late summer into autumn. \n\nIt is ready to harvest when the flower shoots (spears) are well formed but still in bud, before individual flowers begin to open. \n\nCut the central spear first.  This is followed by a series of side-shoots, which can be picked regularly over four to six weeks. Birds, especially pigeons, can cause an array of problems including eating seedlings, buds, leaves, fruit and vegetables. Protect the plants from birds by covering them with netting or fleece.  Scarecrows and bird-scaring mechanisms work for a while, but the most reliable method of protection is to cover plants with horticultural fleece or mesh. A number of caterpillars will feed on brassicas, but the most common are those of cabbage white butterflies.  You will usually see the caterpillars, if not, you will see the holes they make in the leaves.  They will also bore into the heart of cabbages. In mild attacks, or if you have only a few plants, you may be able to pick the caterpillars off.  Insect-proof mesh or fine netting (5-7mm mesh) can prevent egg-laying. Roots become swollen and distorted, and leaves become pale and yellow and wilt easily.  Plants may die. Improve drainage and add lime to make soil more alkaline.  Do not grow in affected soil"
	},
	{
		"name": "Carrots",
		"imgUrl": "https://www.rhs.org.uk/getmedia/2e29792d-d556-4bee-a870-f9d657ca9635/Daucus-carota-Sweet-Candle-_PUB0012429.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [
			null,
			"Sow",
			"Sow",
			"Sow",
			"Harvest",
			"Harvest",
			"Harvest",
			"Harvest"
		],
		"desc": "Sweet, tasty and packed with vitamins, carrots are a traditional grow-your-own favourite.  As well as the classic long orange roots, you can also grow small round carrots and even red, yellow or purple varieties.  \n\nCarrots are straightforward to grow from seed, taking up little space, and can even be grown in containers.  Sow small batches regularly from early spring onwards, for harvests almost all year round. \n Home-grown carrots may not always be as straight and uniform as supermarket carrots, but they taste so much better, so are well worth growing.  If you make regular sowings, you can enjoy your own fresh, super-sweet carrots virtually throughout the year. \n\nCarrots (Daucus carota) like a sun and light, well-drained soil.  If your soil is stony, shallow or heavy clay, you may end up with stunted or forked carrots, so try short-rooted types or grow them in raised beds or containers.  Carrots are drought resistant, so rarely need watering. There are numerous varieties to choose from, for roots of various sizes and shapes.  There are even different colours, including purple, white and yellow.   Choose early varieties for sowing from early spring, then maincrop varieties for sowing from late spring through to mid-summer.   Short- or round-rooted varieties are best for growing in stony or heavy soil, to avoid forking, and are also ideal for containers.  Long-rooted varieties are suitable for deep, sandy soil.  A few varieties may offer some resistance to carrot fly.  For the most reliable varieties, look for those with an RHS Award of Garden Merit (AGM), which means they have performed well in RHS growing trials.  See Recommended varieties, below. Carrot seeds are widely available from garden centres and other seed stockists.  They are usually reasonably cheap, with plenty of seeds in a packet. Carrots grow best in full sun and light, fertile, well-drained soil.  If your soil is stony, shallow or heavy clay, you may end up with stunted or forked roots, so try short-rooted types. \n\nBefore sowing dig over the area to a spades depth, removing weeds, and as many stones as possible.  Incorporate plenty of well-rotted manure or compost or / and granular general fertiliser.  Ideally allow the to ground to settle and consolidate before sowing. \n\nEarly varieties can be sown in February or March under cloches or covered with fleece.  The main outdoor sowing season is from April to early July.  The seed packet will state whether it’s an early or maincrop variety. \nSow the seeds as thinly as possible, 1cm (½in) deep, in rows 15–30cm (6–12in) apart.  Seeds can be slow to germinate, so be patient.  Seedlings can be vulnerable to slugs and snails, so put protection in place. \nThin out the seedlings if necessary, aiming for plants 5–7. 5cm (2–3in) apart.  Sowing small batches every three to four weeks will give you continuous harvests. Carrots grow well in deep containers of multi-purpose compost, so are a great crop if you have limited space.  They need full sun and regular watering.  Round-rooted types are ideal, or you can sow long carrots but harvest when young, as baby veg. \n\nGuide to sowing outdoors     \nGuide to preparing soil          \nGuide to growing veg in containers      Carrots are drought resistant so seldom need watering.  However, in long dry spells they will benefit from a soaking. Fast-growing weeds can crowd out carrots, so hand weed regularly between rows.  Be careful when weeding or thinning that you don’t crush the foliage, as the smell attracts carrot fly. Carrots are ready about 12–16 weeks after sowing.  So from repeated sowings you can enjoy fresh carrots from late spring to autumn. \n\nHarvest as soon as they’re large enough to use – don’t aim for the largest roots or you’ll sacrifice flavour. \n\nLift the roots carefully using a fork if your soil is heavy. Carrot fly is a small black-bodied fly whose larvae feed on the roots of carrots.  The larvae tunnel into the developing carrots causing them to rot. Once you have an attack of carrot fly, there is nothing you can do to get rid of this pest.  Prevention is the best cure, and you should sow thinly and avoid crushing the foliage as you thin out seedlings or hand weed.  You can surround your carrots with 60cm (2ft) high barriers made of clear polythene which will exclude the low-flying female flies, or cover the plants with horticultural fleece, such as Enviromesh. Look for colonies of greenfly on the soft shoot tips of plants or on leaves.  They suck sap and excrete sticky honeydew, encouraging the growth of black sooty moulds. Use your finger and thumb to squash aphid colonies or use biological control in the greenhouse. Raymond Blanc shares his mother’s vegetable and chervil soup recipe, which uses fresh carrots. Antony Worrall Thompson's tempting root vegetable gratin dauphinoise combines carrots, squash and other vegetables with sliced potatoes and melted cheese"
	},
	{
		"name": "Cauliflower",
		"imgUrl": "https://www.rhs.org.uk/getmedia/71d0c405-03cb-4c2e-ae54-1dfbe4b0ea17/Cauliflower_PUB0004106.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [
			"Harvest",
			"Harvest",
			"Harvest",
			"Sow",
			"Harvest",
			"Harvest",
			"Harvest",
			"Harvest"
		],
		"desc": "In the shops, cauliflowers are almost always creamy white, but grow your own and you can enjoy attractive and tasty yellow, green or purple ones.  They take up quite a bit of space, need rich, deep soil and need plenty of watering, especially in summer, but they can be grown all year round. Sow thinly, 2cm (¾in) deep in a seedbed.  Final rows should be 15cm (6in) apart for mini caulis or around 60cm (24in) for larger cultivars.  Thin the seedlings to a final spacing of 15cm (6in) apart for mini caulis or 60cm (24in) for larger cultivars.  However, best results come from sowing in cell trays using any good multi-purpose potting compost.  As cauliflowers mature in a rush, avoid raising too many plants at a time. The main sowing period is March to May, although early crops can be achieved by sowing under glass in January/February or sowing cultivars in the autumn in a glasshouse or coldframe. Cauliflowers do best in very fertile soil, and digging in a bucketful of well-rotted manure or organic matter before planting, and raking in a high potassium general fertiliser, such as Vitax Q4, at a rate of three handfuls per square metre/yard, will help growth.  Firm the soil by treading before planting. If growth is checked, at any time during growth, they produce small, deformed heads.  To avoid problems, water plants well the day before transplanting and make a hole deep enough to hold the plant with the lowest leaves at ground level.  Fill this hole repeatedly with water.  This will fill the hole with soil and ensure the plant is sitting in a large area of moist soil.  Firm the soil very well against the roots. Space summer and autumn cropping types 60cm (2ft) apart and winter cultivars around 75cm (2. 5ft) apart; spacing  of 30-45cm (12-18in) apart, provides mini, 'one person' curds. Water well in dry weather, watering every 10 days, and apply sufficient water to thoroughly wet the root zone.  Once the plants are growing well, add 30g (1oz) per square metre of high nitrogen fertiliser such as sulphate of ammonia to boost growth and curd formation. You can harvest cauliflowers throughout the year, depending on when you sow.  They generally take three to five months from sowing to maturity, but growth rates vary according to the variety and weather conditions.  \n\nDifferent varieties mature at different sizes, so check the seed packet and harvest at the recommended size. \n\nThe head should be firm and compact – once it starts to separate, it's past its best and will taste bitter.  White varieties should be harvested before they turn yellow. \n\nCut the stem with a knife, taking the head and a few of the leaves beneath it. Roots become swollen and distorted, and leaves become pale and yellow and wilt easily.  Plants may die. Improve drainage and add lime to make soil more alkaline.  Do not grow in affected soil. Birds, especially pigeons, can cause an array of problems including eating seedlings, buds, leaves, fruit and vegetables. Protect the plants from birds by covering them with netting or fleece.  Scarecrows and bird-scaring mechanisms work for a while, but the most reliable method of protection is to cover plants with horticultural fleece or mesh. A number of caterpillars will feed on brassicas, but the most common are those of cabbage white butterflies.  You will usually see the caterpillars, if not, you will see the holes they make in the leaves.  They will also bore into the heart of cabbages. In mild attacks, or if you have only a few plants, you may be able to pick the caterpillars off.  Insect-proof mesh or fine netting (5-7mm mesh) can prevent egg-laying"
	},
	{
		"name": "Celeriac",
		"imgUrl": "https://www.rhs.org.uk/getmedia/12f78fdc-7252-4ab7-98a7-ce1a071142c4/celeriac.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": ["Harvest", "Harvest", "Harvest", "Sow", "Plant"],
		"desc": "Celeriac has a similar flavour to celery, which is a close relative, but is hardier and more disease resistant.  Although it looks like a large rounded root, the edible part is in fact a swollen stem.  To grow well, it needs plenty of moisture, and should never be allowed to dry out.  Newer varieties tend to be less knobbly, so are easier to prepare in the kitchen. Start seeds off in March, sowing thinly in a small pot.  Place the pot in a propagator at 15–18°C (59–65°F), or cover with a clear plastic bag and keep in a warm location.  Alternatively, place in a coldframe in milder areas. Germination can be erratic.  Once seedlings appear, grow on in a frost-free greenhouse or coldframe, although good results are possible on a bright windowsill. \n Transfer seedlings to individual small pots as soon as they can be handled.  Keep at 15–18°C (60–65°F), as cold temperatures can lead to premature flowering (bolting). Celeriac is a moisture-loving plant, so keep the soil constantly damp – it should never be allowed to dry out.  Cover the ground with a thick layer of mulch, such as garden compost, to hold in moisture, and keep the area weed free. As the plants mature, remove the outer leaves when they fall horizontal, to expose the crown and allow it to develop.  Remove any side-shoots if they appear. You can harvest celeriac from October through to the following March.  They develop a stronger flavour over time. \n\nTo harvest, carefully ease individual plants out of the ground with a fork.  \n\nCeleriac is hardy and can be left in the ground until required.  It’s best to cover plants with a thick layer of bracken or straw during the cold winter months to prevent the soil freezing and make harvesting easier. Alternatively, if you want to free up space on the veg plot for spring sowings, you can lift plants in early spring and either transplant into spare ground elsewhere or store them in potting compost indoors with the leaves twisted off. Celery leaf spot: Brown spots appear first on older leaves, spreading to younger leaves. Remedy: Use treated seed and rotate crops. These feed on the young seedlings and you'll see the tell tale slime trail on the soil around your crop, as well as on the leaves. There are many ways to control slugs and snails, including beer traps, sawdust or eggshell barriers, copper tape and biocontrols. Small larvae tunnel through the leaves, leaving brown blisters.  Severe attacks check growth. Grow under horticultural fleece or mesh.  Pinch out affected leaves; do not plant seedlings with affected leaves.  Parsnips can also be affected"
	},
	{
		"name": "Celery",
		"imgUrl": "https://www.rhs.org.uk/getmedia/285e134e-9324-471d-87cc-3093036315e4/celery.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [
			null,
			null,
			"Sow",
			"Sow",
			"Plant",
			"Plant",
			"Harvest",
			"Harvest"
		],
		"desc": "The wild celery plant - from which cultivated varieties are selected - is found on boggy riversides and marshy ground, giving a clue to the growing conditions it needs.  Soil should be moisture-retentive and never dry out.  Celery hearts are particularly tasty and can be eaten raw or braised by simmering. Sow between mid-March and early April in seed trays, modules or pots of moist compost at 15°C (59°F).  Sowing seed direct reduces transplant shock, but it is better to start in trays or pots and transfer modules as soon as the seedlings can be handled. Sow seed thinly and apply the merest of covering of fine vermiculite or sieved compost.  Patience is needed as germination takes time.  Transplant the young seedlings when large enough to handle, which might not be until several true leaves appear.  Plant single seedlings into 7. 5cm (3in) pots or modules. Low temperatures after germination can cause ‘bolting’ (running to seed) later in life; temperatures should not fall below 10°C (50°F) for long than 12 hours until they are established.  Delay sowing until suitable temperatures can be maintained. The key to success with celery is plenty of water throughout the growing season. It is also liable to bolt or run to flower and seed if shocked or chilled during transplanting or growth.  Make sure plants are properly ‘hardened off’ (acclimatised to outdoor conditions) before planting out at the end of May to early June. Trenching celery: dig a trench 38-50cm (15-20in) wide and 30 cm (12in) deep in October/November or March, incorporating plenty of well rotted organic matter.  Add a high potassium general fertiliser, such as Vitax Q4, at a rate of two handfuls per square metre/yard .  Plant in line along trench. Plants can be then earthed up (mounding soil around the stems) so the stems become blanched, start doing this once stems are 30cm tall.  Draw up the soil 7. 5cm (3in) at a time until the top is exposed.  Alternatively, use collars made of corrugated cardboard, brown paper, newspaper, plastic drainpipe or similar. Other celery, including green and self-blanching celery: Plant 23cm (9in) apart in a block to ensure the plants shade each other to aid blanching. Water regularly before the onset of dry weather – plants should never be allowed to dry out. Self-blanching celery can be planted at ground level and will blanch itself by self-shading. If growing celery in pots, feed every fortnight with a balanced liquid general fertiliser during the summer. A light dressing of a high nitrogen fertiliser once they are established improves crops. Celery is ready to harvest once it reaches the desired size, between August and October, and before the first hard frost. \n\nMost types of celery will be damaged by frost, but varieties of trench celery (which are grown in trenches and earthed up) might last into winter, as late as December. \n\nTo harvest, cut plants at the base with a sharp knife. These feed on the young seedlings and you'll see the tell tale slime trail on the soil around your crop, as well as on the leaves. There are many ways to control slugs and snails, including beer traps, sawdust or eggshell barriers, copper tape and biocontrols. Brown spots appear first on older leaves, spreading to younger leaves. Use treated seed and rotate crops. A hearty roasted celery soup is great for the cold weather.  Enjoy with a big chunk of crusty bread"
	},
	{
		"name": "Chard",
		"imgUrl": "https://www.rhs.org.uk/getmedia/0e17ca74-25c8-4d4c-a0ab-2e11984901d9/Rhubarb-chard940x627.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [
			"Harvest",
			"Harvest",
			"Harvest",
			"Harvest",
			"Harvest",
			"Harvest",
			"Harvest",
			"Harvest"
		],
		"desc": "Chard, or leaf beet, is an attractive vegetable, with leaf stalks in an array of bright colours.  It’s similar to spinach, but easier to grow as it’s less likely to go to seed in dry weather and one sowing produces a crop that lasts many months.  Young leaves can be eaten raw in salads, while larger leaves are delicious cooked.  Chard grows best in an open, sunny site, although it can tolerate some shade in summer.  It prefers rich, moisture-retentive, free-draining soil. Add organic matter (such as home-made compost) to improve the soil, ideally in autumn or winter prior to sowing.  Just before you sow, you can also add a high potassium general fertiliser, such as Vitax Q4, at a rate of two handfuls per square metre/yard. From March to July, sow seeds thinly, 2. 5cm (1in) deep and 10cm (4in) apart, in rows 45cm (18in) apart.  Two sowings – one in April and the second in July – are usually sufficient.  The July sowing provides leaves the following spring when growth resumes. Alternatively, sow in modules or trays indoors, and transplant outside when large enough to handle. To produce regular pickings of mini-leaves for salads, sow small batches every two weeks. For cut-and-come-again crops, where you pick a few leaves from each plant at regular intervals, sow from April to August in broad drills. Thin out the seedlings once they’re large enough to handle, to 30cm (1ft) apart, or 5cm (2in) apart for mini-leaves.  Use the thinned seedlings in salads. Water in dry spells.  Spread a thick layer of mulch, such as garden compost, around the plants when the soil is warm and damp, to help hold in moisture and suppress weeds. In October, cover plants for overwintering with cloches or protect the crown with straw, or similar material, then cover with fleece. Individual plants can provide pickings for several months, and if you sow in spring and again in mid-summer, you should have harvests for most of the year. \n\nCut off the outer leaves first, when they’re young and tender, working towards the centre.  Don’t wait until they reach maximum size. Harvest regularly to ensure a constant supply of tender re-growth. Pick cut-and-come-again crops at any stage, once the plants have reached at least 5cm (2in) tall.  Snip mini-leaves as soon as they’re a usable size.  They should re-grow if you leave a small stump. Worse in mild, humid weather, the felty mildew makes the leaves unappetising.  Well grown plants in gardens are not usually badly affected except in wet weather.  Can be a problem in densely sown crops, especially ‘cut and come again’ veg crops.  Seedlings suddenly collapse. Sow thinly and when conditions are warm.  You can help to prevent this disease by making sure there is plenty of space around seedlings and plants to improve air circulation, watering the soil at the base of the plants, and by choosing mildew resistant varieties. A usually grey, fuzzy fungal growth which can begin as pale or discoloured patches.  Grey mould ( botrytis) is a common disease especially in damp or humid conditions.  Spores enter plants via damaged tissue, wounds or open flowers.  Mould can also damage ripening fruit such as strawberries.  Black resting spores survive over winter. Remove damaged plant parts before they can become infected.  Cut out infected areas into healthy tissue and clear up infected debris.  In greenhouses, reduce humidity by ventilating and avoid overcrowding of young plants and seedlings. Birds, especially pigeons, can cause an array of problems including eating seedlings, buds, leaves, fruit and vegetables. Protect the plants from birds by covering them with netting or fleece.  Scarecrows and bird-scaring mechanisms work for a while, but the most reliable method of protection is to cover plants with horticultural fleece or mesh"
	},
	{
		"name": "Chicory",
		"imgUrl": "https://www.rhs.org.uk/getmedia/06c9a2cd-79c1-4d10-9a5e-2d60d8d45f78/chicory.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [
			"Harvest",
			"Harvest",
			null,
			"Sow",
			"Sow",
			"Harvest",
			"Harvest",
			"Harvest"
		],
		"desc": "There are three types of chicory: forcing types like ‘Witloof’ grown for their plump leafy heads or ‘chicons’ when blanched; red chicory or radicchio which responds to change in day length by turning red; finally non-forcing or sugar loaf types that produce large hearted lettuce-like heads (heading forms) for autumn harvest.  Chicory is used as a bitter flavouring to autumn and spring salads – add tomatoes or sweet dressing to reduce bitterness. Cultivars for forcing are sown in May and June; non-forcing varieties in June and July.  For mini leaves, non-forcing types can be sown at any time in a glasshouse from late winter in until early auutmn. Sow thinly 1cm (½in) deep in rows 30cm (12in) apart; for mini leaves every 5cm (2in). Chicory prefers an open, sunny site but summer crops and mini leaves will tolerate some shade, soil should be fertile and free draining. Thin seedlings of forcing types to 15cm (6in) apart, thin non-forcing ones to 30cm (12in), and 5cm for mini leaves. Water thoroughly in dry weather and give plants in containers a general liquid feed fortnightly in summer. Lift the roots of forcing varieties in November, discard any less than 2. 5cm (1in) across at the crown.  Cut back leaves to 2. 5cm (1in) above the crown. Pack roots horizontally in sand in a cool shed until required.  Force a few at a time by planting five in a 25cm (10in) pot of moist compost, leaving the crown exposed. Cover with a black polythene bag (or pot with drainage holes covered to exclude the light) and keep at 10-15°C (50-59°F) to produce the ‘chicons’. Start blanching radicchio about 12 weeks after sowing.  Make sure the leaves are dry, and loosely tie together.  Cover with a black plastic pot with the drainage holes covered until the leaves blanch.  Most types form good heads without any need to tie or blanch – the outer leaves blanch the inner ones.  Rotting: Leaves rot in damp conditions or when plants are grown under cover. Remedy: Remove damaged leaves, and improve ventilation under cover. These feed on the young seedlings and you'll see the tell tale slime trail on the soil around your crop, as well as on the leaves. There are many ways to control slugs and snails, including beer traps, sawdust or eggshell barriers, copper tape and biocontrols"
	},
	{
		"name": "Chilli peppers",
		"imgUrl": "https://www.rhs.org.uk/getmedia/b6c8e0a5-cc01-4f18-9182-fc1da27d4cb3/chilli_pepper_MAR0010547.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [
			null,
			"Sow",
			"Sow",
			"Sow",
			null,
			"Harvest",
			"Harvest",
			"Harvest"
		],
		"desc": "Growing your own chilli peppers means you can choose from a huge array of colours, shapes, flavours and levels of heat – a much wider range than you can buy in supermarkets.  Chillies are easy to grow in pots in a greenhouse or, after starting off indoors, can be grown outdoors in a warm sunny spot. Sow seeds indoors from late winter to mid-spring – an early start will give you earlier and longer harvests. \n\nFill a small pot with seed compost, firm gently then sow a few seeds on top.  Most seeds will germinate, so only sow a few more than you need, in case of losses.  Cover with a fine layer of vermiculite, pop in a plant label and water. Seeds will germinate quickly in a heated propagator at 21ºC (70ºF) or simply put the pots on a warm sunny windowsill.  Place a clear plastic bag over each pot, secured with an elastic band, to raise the humidity. As soon as seedlings appear, take the pot out of the propagator or remove the plastic bag.  Keep plants at 16–18ºC (60–64ºF) in good light and water regularly. \n\nWhen the seedlings are 2. 5cm (1in) tall, move each one into its own small pot filled with multi-purpose compost.  If you don’t have time to sow seeds, or don’t have a suitably warm, bright place to raise good plants, then buy young chilli plants from garden centres in late spring.  Grafted seedlings can also be ordered from online suppliers for delivery from mid-April.  These vigorous plants are especially useful where growing conditions are a little cool. While plants are still growing indoors, move them into larger 13cm (5in) pots when roots begin to show through the drainage holes in the base. When they reach about 20cm (8in) tall, or if they start to lean, stake with a thin cane. Pinch out the shoot tips when plants are about 30cm (1ft) tall to encourage lots of branches, which should give you more fruit. By late May, move each plant into its final 22cm (9in) pot or plant three in a standard growing bag.  The plants will grow and crop best if kept in a greenhouse, polytunnel, conservatory or coldframe.  However, in mild parts of the country you can move them outside, once all danger of frost has passed.  \n\nChilli plants will tolerate a minimum night temperature of 12ºC (54ºF), but better results are achieved above 15ºC (59ºF), and avoid temperatures over 30ºC (86ºF) as this can reduce fruiting.  \n\nOutdoors, chilli plants can be kept in large containers or planted in the ground in a very warm, sunny, sheltered location.  \n Before planting chillies outside in late May/early June (after the last frost), harden off plants for two to three weeks.  Also, warm the soil with polythene or cloches two weeks ahead of planting. \n\nChillies need your warmest, sunniest spot to produce a good crop outdoors.  They also like well-drained, fertile, moisture-retentive soil, which is slightly acid.  To achieve this, dig moderate amounts of well-rotted manure (5. 4kg/10lb per sq m/yd) into the soil before planting, but avoid using fresh manure or large quantities, as this may lead to lush, leafy growth at the expense of fruit.  \n\nSpace plants 38–45cm (15–18in) apart, depending on the variety.  Dwarf varieties can be spaced 30cm (1ft) apart.  Cover plants with fleece or cloches to provide wind protection, preferably until the end of June. \n Water little and often to keep the soil evenly moist, avoiding waterlogging and drought.  Mulch the soil surface to help retain moisture. \n\nPlants in containers need to be monitored regularly to ensure they don’t dry out.  \n\nMaintain a humid atmosphere in greenhouses by damping down twice a day during hot weather. Chillies naturally branch into two or more stems with a flower bud at the joint.  To encourage side-shoots on slow-growing plants, pinch out shoot tips once plants reach 30cm (1ft) tall. Staking may be needed for large plants and those in growing bags.  Several canes should be used per plant, as the stems are brittle. Chillies are generally ready for harvesting from mid-summer into autumn if grown in a greenhouse.  Fruiting outdoors should start by August. Pick fruits when they are green to encourage further cropping.  Left on the plant, fruits will change colour and develop a hotter flavour If fruit is left to ripen on the plant, new flowers are not formed and this can lead to a reduction in the overall harvest of 25% or more Because mature fruits are more colourful and better flavoured, the smaller harvest of mature fruit is often thought to be worthwhileAt the end of the season, chillies can be harvested and used fresh or made into pickles and sauces Chillies will eventually shrivel up and dry on the plant or can be picked and dried in an airing cupboard, then used as flakes in cookingLook for colonies of greenfly on the soft shoot tips of plants or on leaves.  They suck sap and excrete sticky honeydew, encouraging the growth of black sooty moulds. Use your finger and thumb to squash aphid colonies or use biological control in the greenhouse. Small white flies suck sap and excrete sticky ‘honeydew’ over the plant, encouraging the growth of sooty mould. Use biological control or sticky traps in the greenhouse. A usually grey, fuzzy fungal growth which can begin as pale or discoloured patches.  Grey mould ( botrytis) is a common disease especially in damp or humid conditions.  Spores enter plants via damaged tissue, wounds or open flowers.  Mould can also damage ripening fruit such as strawberries.  Black resting spores survive over winter. Remove damaged plant parts before they can become infected.  Cut out infected areas into healthy tissue and clear up infected debris.  In greenhouses, reduce humidity by ventilating and avoid overcrowding of young plants and seedlings. Leaves become mottled, pale and covered in webbing, on which the mites can be clearly seen; leaves also drop prematurely. They thrive in hot, dry conditions, so mist plants regularly.  Use biological control in the greenhouse. Nigel Slater uses chillies in his delicious spiced pork patties in lettuce leaves"
	},
	{
		"name": "Courgettes",
		"imgUrl": "https://www.rhs.org.uk/getmedia/fe7cc5ce-ea4e-4fdd-b9a8-6f0bad33ca52/courgettes.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [
			null,
			null,
			null,
			"Sow",
			"Sow",
			"Harvest",
			"Harvest",
			"Harvest"
		],
		"desc": "Courgette plants are easy to grow and fruit abundantly – expect to pick three or four a week in good weather.  These plants like to spread out, so give them about a square metre/yard each, or grow in large containers or growing bags if you’re short of space. Courgettes are easy to grow from seed.  They are best started off indoors in pots, but you can also sow them outdoors in the spot where they are to grow. For earlier crops or in cold regions, sow seeds indoors from mid- to late April at 18–21°C (65–70°F).  Sow seeds individually on their side, 1. 5cm (½in) deep, in 7. 5cm (3in) pots of compost. In late May or early June, prepare your sowing site by digging in lots of home-made compost or well-rotted manure, to about the depth and width of a spade’s blade.  Then sow two or three seeds in the centre, 2. 5cm (1in) deep.  Cover with a cloche, jar or plastic, and leave the covering in place for two weeks, or as long as possible, after germination.  If more than one seed germinates, remove the smaller, weaker seedlings to leave just the strongest one. You can also buy young plants from garden centres in spring.  Plant out in late May to early June, after all risk of frost has passed. Indoor-raised plants must be hardened off (acclimatised to outdoor conditions) before planting outside in June.  Do this by moving young plants into a coldframe for a week.  If you don’t have a coldframe, move them outdoors during the day, then bring them in at night for a week.  Then the following week, leave them out in a sheltered spot all day and night. \n\nCourgettes need a sunny spot and rich soil, so prepare the planting site for indoor-raised plants as follows:Make a hole about a spade’s depth and widthFill the hole with a mixture of home-made compost or well-rotted manure and soil Sprinkle a general purpose fertiliser, such as Vitax Q4 over the soil at a rate of two handfuls per square metre/yard. Then plant one courgette in the centre.  If you’re growing several, space them 90cm (3ft) apart.  You can also grow courgettes in growing bags or large containers (at least 45cm/18in wide).  Plant one or two per bag or one per container.  Courgettes are thirsty plants and need regular and generous watering as they grow.  When you water, try not to splash the leaves.  A useful tip is to sink a 15cm (6in) pot into the ground alongside your plant.  Then water into the pot, so the water goes right down to the roots and doesn’t sit around the neck of the plant, which can lead to rotting. \n \nFeed every 10–14 days with a high potassium liquid fertiliser, such as tomato feed, once the first fruits start to swell. Courgette plants usually fruit for many months, from early summer onwards, sometimes right through to the first frost. \n\nPick the courgettes when they’re young and tasty, 10–12. 5cm (4–5in) long. Regular harvesting, when the fruits are small, will encourage more to form. \n\nThe flowers can also be harvested, and have a mild courgette flavour.  They can be eaten raw in salads or stuffed and fried.  Use straight away, as they don’t keep for long. Appears as a white powdery deposit over the leaf surface and leaves become stunted and shrivel. Keep the soil moist and grow in cooler locations. This is a physiological problem, caused by the growing conditions, not a pest or disease.  It is a problem when the weather in early summer is cool and this causes inadequate pollination. This is usually a temporary problem and once the weather starts to improve, so will pollination.  You can try to hand-pollinate plants yourself by removing a male flower (no swelling at their base) and brushing the central parts against the centre of a female flower (female flowers have a swelling at the base – this is the beginning of the fruit).  But this is a bit of a hassle, and normally the plant will correct this problem itself. A usually grey, fuzzy fungal growth which can begin as pale or discoloured patches.  Grey mould ( botrytis) is a common disease especially in damp or humid conditions.  Spores enter plants via damaged tissue, wounds or open flowers.  Mould can also damage ripening fruit such as strawberries.  Black resting spores survive over winter. Remove damaged plant parts before they can become infected.  Cut out infected areas into healthy tissue and clear up infected debris.  In greenhouses, reduce humidity by ventilating and avoid overcrowding of young plants and seedlings. Greg Wallace tempts us with his grilled vegetable terrine"
	},
	{
		"name": "Cucumbers",
		"imgUrl": "https://www.rhs.org.uk/getmedia/4eefe3e7-0d21-4ea9-a74a-2df0409c9382/Cucumber-Swing-_WSYD0018485;Cucumber-Swing-;1876TN22.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [
			null,
			null,
			"Sow",
			"Sow",
			"Sow",
			"Harvest",
			"Harvest",
			"Harvest"
		],
		"desc": "Home-grown cucumbers taste fabulous and can be grown in a greenhouse or in a warm sheltered spot outdoors, depending on the variety.  Seeds can be sown indoors or outside too, from spring to early summer, or you can buy young plants from garden centres.  Sow cucumber seeds on their side, 1–2cm (½–¾in) deep, in small pots.  Keep them at 21°C (70°F) in a heated propagator or on a warm sunny indoor windowsill. \n\nSow from mid-February to mid-March if you’ll be growing them in a heated greenhouse, or in April if you have an unheated greenhouse.  If you’re going to plant them outdoors, sow in late April. Outdoor varieties can be sown directly in their growing site in late May or early June.  Sow seeds 1–2cm (½–¾in) deep. \n\nCover the ground with fleece, a cloche or glass jar after sowing.  This method can work well in milder southern areas and in warm summers. \n\nYoung plants are also available from garden centres in spring. Make sure your cucumber plants don’t get chilled – they must be kept above 12–15°C (53–59°F). \n\nTransfer young plants to 25cm (10in) pots of good-quality potting compost in late March (in a heated greenhouse) or late May (in an unheated greenhouse).  You can also use growing bags, but plants will need to be carefully watered and looked after.  Alternatively, plant into greenhouse borders, enriched with plenty of garden compost. Water little and often to keep the potting compost or soil evenly moist.  Raise the humidity in hot weather by watering the greenhouse floor, so the moisture evaporates. \n\nFeed every 10–14 days with a balanced liquid fertiliser. \n\nTrain the main stem up a vertical wire or cane.  Pinch out the growing point when it reaches the greenhouse roof.  Pinch out the tips of sideshoots two leaves beyond a female flower (which has a tiny fruit behind it).  Pinch out the tips of flowerless sideshoots once they reach 60cm (2ft) long. Plant out young plants or sow seeds outdoors in early June, ideally under fleece or cloches. \n\nChoose a warm, sheltered, sunny spot with fertile soil.  Prepare the ground by digging in up to two bucketfuls of well-rotted organic matter, such as garden compost, then rake in 100g per square metre (3½oz per square yard) of general purpose fertiliser. \n\nWhen plants have developed seven leaves, pinch out the growing tip.  The developing sideshoots can be left to trail over the ground or trained up stout netting.  Pinch out the tips of flowerless sideshoots after seven leaves. \n \nDon’t remove the male flowers, and keep the soil constantly moist by watering around the plant, not over it.  Cucumbers ripen from mid-summer to mid-autumn in a greenhouse, with a shorter season outdoors depending on the weather. \n\nFruit size varies according to the variety, so check your seed packet.  In general, smaller-fruited varieties are best at about 10cm (4in) long and full-sized varieties at about 15–20cm (6–8in).  The fruits should be uniformly green and firm, usually with a slightly rounded tip.  Fruits can grow rapidly, so check them regularly to get them at their best.  If they turn yellowish, bulbous or soft, they may be over ripe.  \n\nCut the stem cleanly with a sharp knife or secateurs.  Regular harvesting encourages further fruiting. Small white flies suck sap and excrete sticky ‘honeydew’ over the plant, encouraging the growth of sooty mould. Use biological control or sticky traps in the greenhouse. Plants and leaves are stunted and deformed, and leaves show distinctive yellow mosaic patterning.  Flowering is reduced or non-existent, while any fruit that do appear are small, pitted, hard and inedible. The disease is spread from plant to plant by sap-sucking aphids, so take any necessary measures to control them.  Infected plants should be destroyed – wash your hands after touching infected material to avoid contaminating healthy plants. Appears as a white powdery deposit over the leaf surface and leaves become stunted and shrivel. Keep the soil moist and grow in cooler locations. Nigel Slater’s radish, mint and feta salad has plenty of cucumber to add freshness and crunch"
	},
	{
		"name": "Florence fennel",
		"imgUrl": "https://www.rhs.org.uk/getmedia/30bb905c-61ce-4052-82a8-aef33a9de5d5/Florence-fennel940x627.jpg?width=944&height=627&ext=.jpg",
		"monthlyJob": [
			null,
			null,
			null,
			"Sow",
			"Sow",
			"Harvest",
			"Harvest",
			"Harvest"
		],
		"desc": "Florence fennel is grown for its swollen leaf bases or ‘bulbs’ and edible leaves.  It can be tricky to grow successfully and needs warmth and consistent moisture.  The succulent bulbs are well worth the effort and have a delicious sweet flavour with a hint of aniseed. Florence fennel grows best during warm summers and needs an open, sunny site with fertile, moist but well-drained soil.  Add plenty of organic matter, such as well-rotted manure or garden compost, to the soil, ideally the winter before sowing.  Fennel dislikes root disturbance, so sow either direct outdoors or singly into modules indoors. \n\nYou can sow outdoors from late spring to mid-summer, 15mm (½in) deep, in rows 30cm (1ft) apart.  Thin out the seedlings to 30cm (1ft) apart when the soil is warm, from May to early July, but take care not to disturb the roots of the remaining plants.  Use bolt-resistant cultivars for mid-June to mid-July sowings. \n\nFennel can also be sown outdoors in large containers filled with multi-purpose compost. \n In cooler climates or for early crops, you can sow seeds singly in modules in a greenhouse or on a warm windowsill.  Sowing one seed per module avoids pricking out and means the young plants can be transplanted outdoors with minimal root disturbance.  Early sowings are very liable to flower prematurely (bolt), so choose a bolt-resistant cultivar.  \n\nPlant out the modules once the soil is warm and there is no danger of frost, from early May onwards.  Gradually acclimatise plants to outdoor conditions (harden off), before planting out. Provide plenty of moisture consistently throughout the growing season, keep the area weed free, and add a mulch of garden compost to the soil to hold in moisture. Feed with a high potassium fertiliser every two weeks once established. The largest bulbs are formed in warm, sunny, moist summers. Earth up (mound soil) round the bulbs as they start to swell, from mid-summer until mid-autumn, to blanch them and protect them from early autumn frosts. Florence fennel can be harvested in late summer and autumn, when the swollen bulbs are  7–10cm (3–4in) across. \n\nCut the bulbs off at ground level, leaving the roots, which should then send up small shoots that can be used in salads. Plants flower and set seed prematurely. Unless growing for seed sow bolt-resistant varieties.  Sow or plant at the correct time and keep the soil or compost moist. These feed on the young seedlings and you'll see the tell tale slime trail on the soil around your crop, as well as on the leaves. There are many ways to control slugs and snails, including beer traps, sawdust or eggshell barriers, copper tape and biocontrols"
	},
	{
		"name": "French beans",
		"imgUrl": "https://www.rhs.org.uk/getmedia/8b5897ad-58fe-457c-9105-a85c09b11681/Dwarf-french-bean571x321.jpg?width=571&height=321&ext=.jpg",
		"monthlyJob": [
			null,
			null,
			null,
			"Sow",
			"Sow",
			"Harvest",
			"Harvest",
			"Harvest"
		],
		"desc": "French beans are delicious and easy to grow in the ground or in containers.  The slender, stringless beans make great finger food for children, and come in a range of attractive colours – as well as the usual green, you can grow cream, yellow and purple-podded varieties.  There are fast-cropping dwarf varieties, as well as climbing varieties that crop over a longer period – both are ideal in small spaces as they take up little ground space. There are two types of French bean – climbing and dwarf.  Dwarf beans are perfect for small spaces, growing well in containers and in the ground.  Climbing beans need tall, sturdy supports and do best in the ground, but can also be grown in large containers.  As they grow vertically, climbers produce a large crop in a small area of ground.  \n\nDwarf beans are quick to grow, but only crop for a few weeks, so make repeat sowings for a summer-long supply.  Climbing beans take longer to reach cropping stage, but will produce beans over a longer period, from mid-summer to early autumn if picked regularly. \n\nYou’ll find a huge range of varieties available as seed in garden centres and online.  There are varieties with pods in a range of attractive colours, from traditional green through shades of yellow and dark purple.  Look in particular for varieties with an RHS Award of Garden Merit (AGM), which shows they performed well in trials – see our list of AGM fruit and veg.  If you don’t have room to grow from seed, young plants can also be bought from garden centres and online suppliers in spring, ready for planting outside. For an early crop, sow indoors in late April to early May.  Use small pots or modules, sowing one bean in each, 5cm (2in) deep.  Place in a propagator or on a warm, sunny windowsill to germinate.  They will grow fast in warm, bright conditions and need watering regularly.  \n\nIn late May or early June, harden off the young plants to acclimatise them to outdoor conditions.  Then plant into their final site, either in the ground or in a large container, after all risk of frost has passed – see Plant outside, below. French beans can be sown outdoors once all risk of frost has passed and the soil is warming up.  This is usually in late May or early June, depending on your local climate.  You can warm the soil with fleece or cloches before sowing, then leave the covering in place after sowing to give the young plants extra protection.  \nIf growing in the ground, choose a warm, sunny spot, then prepare the site by removing weeds and forking in plenty of well-rotted manure or garden compost, and watering well.  \n \nWith climbing beans, it’s best to put the supports in place before sowing – these are usually tall bamboo canes, in a wigwam or double row – see Grow, below, for details.  \n\nDwarf beans are best sown in blocks rather than rows, so they support each other.  \nSow the seeds individually, 5cm (2in) deep and 15cm (6in) apart.  With dwarf beans, you can make several sowings of small batches a few weeks apart, to provide harvests over a longer period.  You can sow seeds outdoors into pots of multi-purpose compost in spring – either into small pots for transplanting into the ground later, or into large containers as their final growing site.  Sow one bean per small pot, 5cm (2in) deep, and place in a coldframe or a warm, sheltered position.  The seedlings may need some protection (such as fleece) at night.  Once the plants reach 8cm (3in) tall and all risk of frost has passed, plant out into their final positions (see Plant outside, below). \n\nBoth dwarf and climbing beans can be grown in large containers and make attractive additions to patios and small gardens.  They need a warm, sheltered, sunny position.  For dwarf beans the container should be 30–45cm (12–18in) wide, and for climbing beans 75cm (30in) wide and 45cm (18in) deep – a large tub or half-barrel is ideal. \n\nSimply sow the seeds direct into the container, spacing them 15cm (6in) apart.  Insert a wigwam of 1. 8m (6ft) canes to support climbing beans (see Grow below), and choose a heavy container to keep it from toppling over.  Dwarf beans don’t usually need support and look great cascading over the sides of a pot, or even in a hanging basket. Wait until after the last frost before planting indoor-raised or bought young plants outside.  Then harden them off to acclimatise them to outdoor conditions for a couple of weeks, either by putting them in a coldframe or placing them in a warm, sheltered spot, covered with fleece.  Once hardened off, plant them into their final growing position, in a sunny, sheltered spot.  If planting in the ground, enrich the soil with well-rotted manure or garden compost beforehand.  If planting in a container, choose multi-purpose or loam-based compost.  Containers should be at least 30–45cm (12–18in) wide for dwarf beans, and 75cm (30in) wide and 45cm (18in) deep for climbing beans. \n\nWater plants well before and after planting, and space them 15cm (6in) apart.  \n\nWith climbing beans, it’s best to put the supports in place first – see Grow, below.  Position one plant at the base of each cane, and loosely tie the shoots to the cane to get them started.  Climbing French beans need tall, sturdy supports to climb up.  The traditional method is to grow them along a double row of bamboo canes (1. 8m/6ft tall), with 45cm (18in) between the two rows.  Space the bamboo canes 15cm (6in) apart within each row and slope them inwards, then tie near the top to a horizontal cane, to form an A-frame. Alternatively, create an X-frame by sloping the canes at a sharper angle so they cross in the middle.  Tie them at the centre, and add a horizontal cane to link them all together and increase stability.  An X-frame takes up more space, but picking is easier and cropping is usually better. \n\nIf you don’t have room for a double row of canes, you can make wigwams.  Again, use 1. 8m (6ft) canes, four or five per wigwam, spacing them 15cm (6in) apart at the base.  Tie the tops of the canes together.  Wigwams make an attractive feature in a border or veg plot and also work\nwell when growing in containers.  Loosely tie young plants to the canes to get them started. With dwarf beans, you can insert short twiggy sticks between the plants to keep them upright and lift the pods off the soil. Beans are thirsty plants and crop best when watered regularly, especially once they start to flower and form pods.  Regular and generous watering is particularly important for plants growing in containers, which dry out quickly. Place a mulch of well-rotted manure or mushroom compost around plants in July to help hold moisture in the soil. WeedingKeep plants weed-free.  Growing plants through slits in weed-suppressing membrane is possible, and prevents the pods of dwarf beans being damaged by contact with the soil. You can harvest French beans from mid-summer to early autumn.  If picked regularly, dwarf French bean plants will crop for several weeks and climbing French beans for much longer. \n\nBegin picking the pods when they’re 10cm (4in) long.  They are ready when they snap easily and before the beans can be seen through the pod. These feed on the young seedlings and you'll see the tell tale slime trail on the soil around your crop, as well as on the leaves. There are many ways to control slugs and snails, including beer traps, sawdust or eggshell barriers, copper tape and biocontrols. Birds, especially pigeons, can cause an array of problems including eating seedlings, buds, leaves, fruit and vegetables. Protect the plants from birds by covering them with netting or fleece.  Scarecrows and bird-scaring mechanisms work for a while, but the most reliable method of protection is to cover plants with horticultural fleece or mesh. Sap-sucking aphids will disfigure plants and cause stunting to leaves and stems. In the case of broad beans, pinch out infested tips.  On other beans, catch populations when small and squash. Try this simple summer salad of French beans atop mozzarella slices with an unusual yoghurt dressing"
	},
	{
		"name": "Garlic",
		"imgUrl": "https://www.rhs.org.uk/getmedia/99ca41fe-a3ec-4edc-bd6c-79428c3df83c/Garlic-bulbs_MAR0002748.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": ["Plant", "Plant", null, null, null, "Harvest", "Harvest"],
		"desc": "A member of the onion family, this staple of Mediterranean cooking is simple to grow in a warm sunny site with well-drained soil.  It is grown from cloves, which are best planted in late autumn, and is ready to harvest the following summer.  Garlic is grown by planting individual cloves of garlic (rather than sowing seeds), usually in autumn – see Plant, below, for full details.  \n\nGarlic is generally trouble free and needs little maintenance, apart from watering in dry spells, and regular weeding.  Also snip off any flower stems that start to form. Water garlic during dry spells in spring and early summer, to improve bulb size.  However, don’t water once the bulbs are large and well formed, as this could encourage rotting.  Yellowing foliage is a sign that the bulbs are reaching this stage of maturity. \n\nTry to avoid overhead watering, as it can encourage fungal diseases. Garlic plants need full sun, so keep weeds at bay to ensure plants don’t get shaded.  Weeding is best done by hand, as hoeing risks damaging the developing bulbs.  To avoid the need to weed regularly, consider planting through black plastic sheeting or weed-suppressing membrane. Always buy named varieties of garlic from a garden centre or mail-order supplier.  It is best not to plant garlic from a supermarket – it may carry diseases and be unsuitable for the British climate, so results may be disappointing. \n\nThere are many varieties of garlic to choose from – look in particular for those with an RHS Award of Garden Merit (AGM), which shows they performed well in growing trials – see our list of AGM fruit and veg. \n\nThere are two main types of garlic – hardneck and softneck. Produces fewer, larger cloves, covered with a looser tunic Has a stronger, more interesting flavourStores only until mid-winter ​Often produces flower stalksProduces smaller, more tightly packed clovesStores for longer – if planted in autumn it will keep well into the following winter, if planted in spring it will keep until the middle of the following spring Does not produce flower stalks unless stressedElephant garlic (Allium ampeloprasum) is often sold as garlic, but is actually more closely related to leeks.  It produces a small number of very large cloves with a mild flavour.  It needs a long, warm growing season to produce a good crop and is best planted in October. \n\nThe cloves sometimes don’t divide, producing just slightly larger single-clove (solo) bulbs.  Early planting often reduces the occurrence of solo bulbs.  The single-clove bulb can be harvested and either eaten or planted again the following autumn, when it will often produce segmented cloves. Garlic needs a period of cold, so is usually planted in late autumn or early winter.  Most varieties need one to two months at 0–10°C (32–50°F) for good bulb development.  However, some cultivars are suitable for planting in early spring. \n\nIf your soil is heavy and damp over winter, it’s better to start garlic off in modules in a coldframe before planting out in spring. \n\nGarlic likes a sunny, well-drained site.  Wet soil and/or high humidity around the foliage can make plants more prone to disease, particularly if planted in autumn.  Garlic doesn’t thrive in acid soil (below pH 6. 5), but you can reduce acidity by applying lime in autumn and winter.  Prior to planting, remove any weeds then improve the soil’s structure, moisture retention and nutrient levels by digging in organic matter.  Apply about two bucketfuls of well-rotted manure or garden compost every square metre/yard.  Avoid using fresh manure. \n\nLittle fertiliser is required at planting.  On average soil, apply a general-purpose fertiliser at a rate of 25g/1oz per square metre/yard.  Where organic matter was not applied, double the amount of fertiliser.  To reduce the need for weeding later, you could cover the soil with black plastic sheeting or weed-suppressing membrane, then plant the cloves through slits.  \n\nCarefully break up the bulbs into individual cloves or segments.  Take care to plant them the right way up, with the flat basal plate facing downwards and the pointed end upwards. \n\nSpace the cloves 15cm (6in) apart, with the tip 2. 5cm (1in) below the soil surface.  In light soil, deeper planting can produce larger bulbs, but don’t plant deeply in heavy soil.  Space rows 30cm (1ft) apart.  \n\nPrevent birds from pulling up newly planted cloves by covering with horticultural fleece until well rooted in. On heavy, wet soil, garlic is best started off in modules in autumn, overwintered in a coldframe or unheated greenhouse, then planted out in spring. Partly fill a modular tray with multi-purpose or soil-based compostInsert one clove into each module and cover with compostKeep in a cool place – a well-ventilated coldframe is ideal – to provide protection from the harshest winter weatherMake sure the compost is moist but not wetPlant out in spring, 15cm (6in) apartWhile the bulbs are still growing, you can harvest a few of the green leaves to use as a garnish or in salads.  You may also find ‘top sets’ or garlic cloves form on the stalk (due to changeable weather in spring) – these can be used as you would normal garlic cloves. \n\nGarlic bulbs are ready to harvest once the leaves have turned yellow.  Autumn-planted garlic is ready in early summer and spring-planted from mid-summer to early autumn.  Try not to delay harvesting, as the bulbs open up and store less well if lifted late.  Carefully dig up the bulbs with a fork.  Handle them gently, as bruising also reduces their storage potential. Dry them off thoroughly in a single layer in the sun – under a cloche or in a greenhouse is ideal.  Ventilate well to avoid excessive heat (above 30°C/86°F).  Alternatively, place in a dry, well-ventilated shed or similar environment. \n\nExpect drying to take two to four weeks, depending on the weather.  If you spot any mould, you can speed up drying using a fan heater, but this is not usually necessary. \n\nOnce the foliage is dry and rustling, cut off the stalk and store the bulbs in a cool, dry place at 5–10oC (41–50oF), where further drying will take place. \n\nGarlic can usually be stored for several months. Although garlic is usually trouble-free, it can be affected by similar pests and diseases as onions and leeks, including leek rust, onion white rot, allium leaf-mining fly and leek moth.  \n\nUnfavourable growing conditions may also lead to:Cloves forming on the stem – this is usually due to adverse weather, such as fluctuating temperatures in spring.  Called top sets, the cloves can be used in the normal way. Flower stalks – hardneck garlic readily produces flower stalks, which should be removed as soon as they appear and can be used in stir-fries.  Softneck garlic occasionally produces flower stalks as a result of adverse growing conditions, such as high temperatures or drought. Split bulbs – the crop was harvested late. Green cloves – usually due to shallow planting or late harvesting.  They can be used as normal, but are unlikely to store well. A soil-borne fungus that can cause yellowing and wilting of the foliage above ground, while rotting the roots and invading the bulb beneath the soil.  A white fluffy fungus appears on the base of the bulb and later becomes covered in small, round black structures. There is no chemical cure for onion white rot when it is the soil.  It is important to avoid introduction to previously clean sites.  It is transported in contaminated soil, for example on tools or on muddy footwear.  Take particular care in areas where cross contamination can occur easily, for example on allotments. This is a fungal disease causing bright yellow spots on the leaves.  It is often worse in long, wet spells. Mild attacks of rust won’t harm the plant, but serious infections may cause leaves to shrivel and affect yield.  There is no control for rust once you have the infection.  Make sure you don’t crowd plants, as this increases humidity and increases the likelihood of infection.  Dispose of any badly affected plant material, and don’t grow garlic, leeks or onions in the same spot for three years. Birds, especially pigeons, can cause an array of problems including eating seedlings, buds, leaves, fruit and vegetables. Protect the plants from birds by covering them with netting or fleece.  Scarecrows and bird-scaring mechanisms work for a while, but the most reliable method of protection is to cover plants with horticultural fleece or mesh. Greg Wallace tempts us with chicken wings with salsa, which has plenty of garlic. Chilli teams up with garlic for this tasty chilli greens recipe. Nigel Slater offers up this Oriental choy sum with oyster sauce. Garlic is a key ingredient in these spiced pork patties in lettuce leaves – you’ll need four cloves. Garlic, ginger and spring onion come together in this Thai-style brassica stir-fry"
	},
	{
		"name": "Globe artichokes",
		"imgUrl": "https://www.rhs.org.uk/getmedia/04f30dc2-8e9f-4824-9ceb-bbf97092adae/Globe-artichoke_PUB0002979.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [
			null,
			null,
			"Plant",
			"Plant",
			null,
			"Harvest",
			"Harvest",
			"Harvest"
		],
		"desc": "Globe artichokes (Cynara scolymus) are large, architectural perennial plants that are attractive enough for the flower garden.  They can be grown from seed or young plants, and their large edible flower buds are easy to cook and delicious!Globe artichokes like a warm sunny spot, in reasonably fertile, free-draining soil.  To make best use of space, sow into a seedbed temporarily, then later transplant to their final position, as they will grow into large plants that need wide spacing.   \n\nSow seeds either indoors or outside in March or April, 13mm (½in) deep.  If starting them off indoors, sow into modules or small pots.  Outdoors, sow two or three seeds every 25–30cm (10–12in), then thin to leave the strongest seedling at each point. \n\nTransplant young plants to their permanent position when they have at least five true leaves, spacing them 60–90cm (2–3ft) apart, and water in well.  They make an attractive addition to flower borders as well as veg plots. \n\nSeed-raised plants tend to be variable and spiny, so only keep the best plants.  You can later propagate your favourites from suckers or by dividing clumps to produce more identical plants. \n\nAlternatively, buy rooted suckers or container-grown plants in garden centres and online. Keep plants weed free and water during dry weather.  Seed-grown plants usually flower in their first summer. \n\nIn colder regions, cover plants in late autumn with a mulch of straw, compost or well-rotted manure, to protect them during cold winter weather. \n\nEach spring, mulch with well-rotted manure or home-made compost, when the soil is warm and moist.  Feed with a high potassium general fertiliser, such as Vitax Q4, at a rate of one handful per square metre/yard, to improve flower production. \n\nTo keep plants vigorous and cropping well, divide every two to three years.  \n\nEstablished plants can be propagated from rooted suckers (shoots arising from a plant’s root system) in March or April.  Choose vigorous suckers, 20–30cm (8–12in) long, with at least two shoots. From June, use secateurs to remove the buds, ideally when they reach the size of a golf ball, before they open and start to flower.  After you harvest the main flower bud, secondary buds will appear, and these too can be harvested when large enough. \n\nGlobe artichokes become more prolific each year until, after several years, they run out of steam and the plants need to be replaced. How to cook and eat:Boil or steam young flower buds until tender, then drain and serve with melted butter, vinaigrette or hollandaise sauce.  To eat, remove the leaf scales one by one, dip in the butter or sauce, then suck out the juicy flesh from each scale.  Finish off with the succulent heart.  Delicious!Mature flowers take longer to cook and are less flavoursome, but can be cooked and eaten in the same way. These feed on the young seedlings and you'll see the tell tale slime trail on the soil around your crop, as well as on the leaves. There are many ways to control slugs and snails, including beer traps, sawdust or eggshell barriers, copper tape and biocontrols. Look for colonies of greenfly on the soft shoot tips of plants or on leaves.  They suck sap and excrete sticky honeydew, encouraging the growth of black sooty moulds. Use your finger and thumb to squash aphid colonies or use biological control in the greenhouse"
	},
	{
		"name": "Kale",
		"imgUrl": "https://www.rhs.org.uk/getmedia/aed086ce-cec8-44f2-851e-39953088106b/Curly-kale-(borecole)-%e2%80%98Reflex%e2%80%99-940x627.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [
			"Harvest",
			"Harvest",
			"Harvest",
			"Sow",
			"Sow",
			"Sow",
			null,
			"Harvest"
		],
		"desc": "Enjoying a recent rise in popularity due to its superfood status, kale (or borecole) is easy to grow and provides harvests over a long period.  It can even be grown in light shade and stands up well to cold temperatures.  Kale is usually sown into a seedbed, away from the main vegetable plot, then later transplanted to its final growing position.  This is because it is slow to grow and would take up a lot of space during the prime growing season on the veg plot if sown straight into its growing site.  \n\nSow kale seeds from March to June in sun or light shade. \n\nPrepare the sowing site by weeding thoroughly and raking the soil level.  Draw out a shallow drill, 1cm (½in) deep, using a stick or the blade of a trowel, then water along the base.  \n\nSow the seeds thinly along the drill.  If sowing more than one row, space them 15cm (6in) apart. Once the seedlings germinate, thin them out to 7. 5cm (3in) apart, to prevent overcrowding as they grow.  The thinnings can be used as baby leaves in salads.  Transplant young kale plants to their final growing position when they have five or six true leaves. Water well the day before moving, lift them carefully, then set them in their new planting hole deep enough so their lowest leaves are at ground level.  Firm in gently, then water generously.  Space plants 45cm (18in) apart. Apply a mulch around the plants to help hold moisture in the soil.  Water well during dry weather. A spring feed will improve results. Protect the plants from birds by covering with netting or fleece. Start to remove young leaves from the top of the plant from September onwards. Side-shoots are formed after the main crown is harvested and these are ready for use in February and March.  Pick shoots that are 10–15cm (4–6in) long and still young. Birds, especially pigeons, can cause an array of problems including eating seedlings, buds, leaves, fruit and vegetables. Protect the plants from birds by covering them with netting or fleece.  Scarecrows and bird-scaring mechanisms work for a while, but the most reliable method of protection is to cover plants with horticultural fleece or mesh. White larvae approximately 5cm (2in) long, feed on the roots just below the soil surface, stunting growth and causing plants to wilt and die. Grow under insect-proof mesh or horticultural fleece.  Seedlings are most vulnerable. A number of caterpillars will feed on brassicas, but the most common are those of cabbage white butterflies.  You will usually see the caterpillars, if not, you will see the holes they make in the leaves.  They will also bore into the heart of cabbages. In mild attacks, or if you have only a few plants, you may be able to pick the caterpillars off.  Insect-proof mesh or fine netting (5-7mm mesh) can prevent egg-laying. Masterchef judge Greg Wallace uses kale, Swiss chard, spinach or spring greens to make delicious and healthy chilli greens"
	},
	{
		"name": "Kohl rabi",
		"imgUrl": "https://www.rhs.org.uk/getmedia/a660b1ff-9e7a-48d7-a759-35e30e60c6ad/Kohlrabi-Kolibri-_WSYD0018490;Kohlrabi-Kolibri-;1008TN3.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [
			null,
			"Sow",
			"Sow",
			"Sow",
			"Harvest",
			"Harvest",
			"Harvest",
			"Harvest"
		],
		"desc": "This strange-looking brassica resembles a Sputnik, but don’t let this put you off.  It has a delicious broccoli-like flavour and is more drought resistant than most brassicas, so succeeds where swedes and turnips fail.  Green varieties are sown from mid-spring to mid-summer for summer crops, while hardier purple varieties are sown from mid-summer for autumn and winter harvests. Kohl rabi is easy to sow outdoors in spring and summer.  It likes a sunny spot in any reasonably light, fertile, free-draining soil. \n\nPrepare the sowing site by weeding and raking to remove lumps and stones, then make a drill 1cm (½in) deep.  Water along the base, then sow seeds thinly, cover with soil and firm gently.  Space rows 30cm (1ft) apart.  You can sow from late February to early March under cloches or fleece, then in open ground through spring to about mid-summer, or to mid-August in warmer areas. Sow little and often, say every three weeks, for a constant supply. In cooler areas and where the soil is heavy clay, early sowings can be made indoors in modules.  Harden off the seedlings and transplant outdoors when they are a maximum of 5cm (2in) tall, once the soil has warmed up. Thin out seedlings when they are 2. 5cm (1in) tall or the first true leaves appear, leaving a final spacing of 15cm (6in) apart. Keep the soil constantly moist and weed free, watering before the soil dries out. Place netting or fleece over young plants to protect against birds and cabbage root fly. Harvest kohl rabi when young, between golf ball and tennis ball size.  If you leave them too long they lose their flavour and tenderness. With repeated sowings, plants can be harvested from May through to November, and the leaves can also be eaten. \n\nGreen varieties, sown from mid-spring, are ready in summer, while hardier purple varieties, sown in summer, provide autumn crops. White larvae approximately 5cm (2in) long, feed on the roots just below the soil surface, stunting growth and causing plants to wilt and die. Grow under insect-proof mesh or horticultural fleece.  Seedlings are most vulnerable. Leaves are covered in small holes and damaged areas turn brown.  Seedlings are particularly susceptible. Grow plants under horticultural fleece and keep the soil moist.  Water in nitrogen-rich fertilser to help the crop outgrow the pest. Roots become swollen and distorted, and leaves become pale and yellow and wilt easily.  Plants may die. Improve drainage and add lime to make soil more alkaline.  Do not grow in affected soil"
	},
	{
		"name": "Leeks",
		"imgUrl": "https://www.rhs.org.uk/getmedia/08cf080f-5a71-4ece-9425-4c0f2062d61c/Allium-porrum-Bandit-_WSYD0005331.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [
			"Harvest",
			"Harvest",
			"Sow",
			"Sow",
			null,
			null,
			"Harvest",
			"Harvest"
		],
		"desc": "Leeks are tasty winter vegetables that are easy to grow, but do take some time and attention – they are usually sown in containers or a ‘seed bed’, then moved to their final position a few months later.  Sow seed in spring, and you’ll be harvesting from autumn through to late winter. For a bumper crop of leeks, improve the growing site by digging in plenty of garden compost or well-rotted manure, ideally in autumn. Leeks are best suited for growing in open ground, but you could grow several in large, deep containers or raised beds. Traditionally, leeks are sown into a seed bed, away from your main vegetable plot, then the young leeks are transplanted in early summer.  This is because sowing leeks at their final spacings in your main vegetable plot would take up a lot of room early in the growing season, when you could be growing fast-maturing crops such as lettuces.  \n\nDuring March or April, sow leek seeds thinly, 1cm (½in) deep, in rows 15cm (6in) apart.  \n\nIf you don’t have space outdoors or only want a few leeks, you can sow in modules indoors, then transplant outdoors later.  Sow one seed per module. To increase the length of white stem, gently draw up dry soil around the plants in stages as they grow, but try not to let soil fall in between the leaves. Water during long dry spells and weed regularly. Start harvesting in late summer, when the leeks are still quite small, to increase the cropping period.  Gently lift from the soil using a fork. Leeks can remain in the ground through the winter until they are needed. This is a fungal disease causing bright yellow spots on the leaves.  It is often worse in long, wet spells. Mild attacks of rust won’t harm the plant, but serious infections may cause leaves to shrivel and affect yield.  There is no control for rust once you have the infection.  Make sure you don’t crowd plants, as this increases humidity and increases the likelihood of infection.  Dispose of any badly affected plant material, and don’t grow garlic, leeks or onions in the same spot for three years. A soil-borne fungus that can cause yellowing and wilting of the foliage above ground, while rotting the roots and invading the bulb beneath the soil.  A white fluffy fungus appears on the base of the bulb and later becomes covered in small, round black structures. There is no chemical cure for onion white rot when it is the soil.  It is important to avoid introduction to previously clean sites.  It is transported in contaminated soil, for example on tools or on muddy footwear.  Take particular care in areas where cross contamination can occur easily, for example on allotments. This is a relatively new pest of leeks and onions and thought to be mainly concentrated around the south-east coast of the UK, although it has been found further inland and north.  Caterpillars tunnel into the leaves, causing whitish-brown patches to develop on leaves.  In severe cases, leaves may turn yellow and rotting occurs within them. Once you see the damage, there is nothing you can do to control it.  Remove and destroy infected plants.  When planting out, cover leeks with horticultural fleece (like Enviromesh) to prevent adult moths from laying eggs"
	},
	{
		"name": "Lettuce",
		"imgUrl": "https://www.rhs.org.uk/getmedia/87eb29f6-29c5-4ba2-ab6c-cd9b1feeb51f/Lettuce_PUB0004183.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [
			null,
			null,
			"Sow",
			"Sow",
			"Harvest",
			"Harvest",
			"Harvest",
			"Harvest"
		],
		"desc": "Lettuces are easy to grow and come in a wide range of colours, flavours and textures – your salads need never be boring! There are two main types – hearting lettuces have a dense centre, while loose-leaf lettuces have open leaves and no heart.  You can also grow various mixes of salad leaves to be picked while young and tender. When buying seeds, there is a huge diversity to choose from. \n\nHearting lettuces, which come in three main types:Butterhead lettuces have an open shape, are quick-maturing and tolerate poorer growing conditionsCos types have an upright, oblong headCrisphead types produce large hearts of curled, crisp leaves and are more resistant to bolting (going to seed prematurely).  This group includes iceberg lettucesLoose-leaf lettuces and salad-leaf mixes produce less dense growth, ideal for picking individual leaves and for growing in small spaces and containers.  Choose from a range of colours, flavours and leaf shapes. Grow lettuces in full sun in moisture-retentive soil.  Early and late sowings may need protection against cold, using cloches, plastic tunnels or horticultural fleece. You can also grow lettuces in containers and growing bags, but be sure to water regularly. \n\nSow seeds thinly, 13mm (½in) deep, in rows 30cm (1ft) apart.  Sow a short row every fortnight to ensure continuity of cropping. When to sow depends on when you want the harvest:For summer/autumn cropping: sow outdoors from late March to late July.  For an even earlier crop, sow indoors in early February in seed trays and plant out in early March under cloches or plastic tunnelsFor early winter cropping: sow outdoors in early August and cover plants with closed cloches from late September onwardsFor spring cropping: sow a cultivar such as ‘Winter Density’ in September/October, either in an unheated greenhouse or in mild areas under cloches or in a coldframe.  When sowing in summer, bear in mind that high soil temperatures can prevent some cultivars from germinating.  So in hot spells, sow in the evening, water with cold water and provide some shade to keep temperatures down. Thin seedlings as soon as the first true leaves appear and continue until the plants are 30cm (1ft) apart.  The seedlings you thin out can be added to salads. Water when the soil is dry, ideally early in the morning. Early in the year, sparrows can be a problem as they find young lettuce plants irresistible.  Protect with fleece, chicken wire or similar.  Also protect plants from slugs and snails – see Common problems below. You can harvest lettuces from late spring through to winter, if sown regularly using suitable seasonal varieties. \n\nWhole lettuces are ready to harvest when a firm heart has formed – cut through the stem at the base. \n\nLoose-leaf varieties can be harvested as soon as the leaves are big enough to be worth eating – either snipping a few outer leaves from each plant or cutting the whole lot from one plant.  These pests can cause older plants to suddenly wilt and die back, usually in mid- to late sunmmer.  You may not see the aphids, as they feed on the roots, not the leaves, but you may see lots of ants around the plants, as they feed on the honeydew that the aphids produce. RemedyThe damage is worse in dry conditions, so keep lettuces well watered.  If you suspect root aphids and only have a few lettuces, you can carefully dig them up, wash off the aphids and replant in fresh compost.  Otherwise, there’s not much you can do, except pull up and destroy affected plants.  Prevention is the best cure, so cover lettuces with insect-proof mesh (such as Enviromesh) from June until August, as this will prevent aphids getting to the roots.  Some lettuces are resistant to root aphids. These feed on the young seedlings and you'll see the tell tale slime trail on the soil around your crop, as well as on the leaves. There are many ways to control slugs and snails, including beer traps, sawdust or eggshell barriers, copper tape and biocontrols. A usually grey, fuzzy fungal growth which can begin as pale or discoloured patches.  Grey mould ( botrytis) is a common disease especially in damp or humid conditions.  Spores enter plants via damaged tissue, wounds or open flowers.  Mould can also damage ripening fruit such as strawberries.  Black resting spores survive over winter. Remove damaged plant parts before they can become infected.  Cut out infected areas into healthy tissue and clear up infected debris.  In greenhouses, reduce humidity by ventilating and avoid overcrowding of young plants and seedlings. Plants flower and set seed prematurely. Unless growing for seed sow bolt-resistant varieties.  Sow or plant at the correct time and keep the soil or compost moist. A mix of salad leaves is used in this salad of leaves and pancetta, while cool lettuce leaves balance the spiciness of the meatballs in these spiced pork patties in lettuce leaves"
	},
	{
		"name": "Onions",
		"imgUrl": "https://www.rhs.org.uk/getmedia/36dce638-3fdd-423d-849f-5cb31161023a/Onion571x321.jpg?width=571&height=321&ext=.jpg",
		"monthlyJob": [
			null,
			null,
			"Plant",
			"Plant",
			null,
			"Harvest",
			"Harvest",
			"Harvest"
		],
		"desc": "Onions are such a versatile vegetable – they feature in so many recipes, and growing your own means you’ll always have them to hand.  They are easy to grow from immature bulbs called sets.  Although seed is available, sets are the easiest and quickest way to grow them.  They can be planting in early autumn or, more usually, in spring, for harvesting through summer and into autumn. Although usually grown from sets, onions can be grown from seed, sown either indoors or outside.  Seed is cheaper to buy, but slower to grow and the seedlings need more careful attention, however seed-grown plants can be less susceptible to bolting (flowering).  To ensure a good crop, seed-raised plants must be growing strongly by late spring, as the lengthening days trigger the formation of bulbs – the more leaves plants have at this time, the better the bulb will be. Sow onion seeds in modules in mid- to late winter and keep in a greenhouse at 10–16°C (50–60°F). \nAlthough one plant per module is effective, growing three to four per module saves space.  Sow five or six seeds per module, then thin out if necessary to three or four plants.  Harden off indoor-sown plants in spring, before transplanting into the ground.  When multi-seeded modules are planted out, the onions form a clump of bulbs. You can sow onions direct outdoors from late winter until mid-spring, once your soil is drying out and beginning to warm up.  Sow seeds 1. 3cm (½in) deep in rows 20cm (8in) apart.  Thin out seedlings first to 5cm (2in) apart, and later to 10cm (4in).  Closer planting will result in more bulbs and a larger overall crop, but smaller individual bulbs. Water in prolonged dry spells every 14 days, and give an occasional feed with a general liquid fertiliser.  But stop watering and feeding once the onions have swollen in mid-summer.  Watering spring-planted crops after mid-summer can mean they store less successfully.  Try to avoid overhead watering, as this can encourage fungal diseases. \n\nIn late winter, give autumn-planted onions a nitrogen-rich fertiliser, such as sulphate of ammonia, at a rate of 35g (1oz) per square metre/yard.  This not only enhances growth but can also suppress premature flowering.  Alternatively, use dry poultry manure. Weed regularly, as onions don’t grow well if competing with other plants.  Take care not to damage the bulbs or foliage if using a hoe – ideally, weed by hand.  As onion foliage casts little shade, weeds grow readily and can soon swamp the crop, which would reduce the plants’ growth and subsequent bulb size. Remove any flower stems as soon as they start to form, otherwise the plant’s energy will go into producing the flower, rather than swelling the bulb. Onions are usually grown from sets (immature bulbs) – this is the easiest and fastest way to grow them, and will produce an earlier crop.  Plants grown from sets are also less likely to be affected by disease.  However, they are more prone to bolting (when a flower is produced instead of a bulb).  To reduce the risk of bolting, choose heat-treated sets. \n\nSets are readily available in early spring and late summer in garden centres and from online suppliers. \n\nThey are usually planted in spring, from mid-March to mid-April.  Some cultivars are suitable for planting in October to mid March – these are less sensitive to cold, which would otherwise cause bolting.  Autumn planting is not suitable in heavy soils prone to waterlogging, as the crop is more likely to succumb to disease. \n\nOnions have a limited root system, so improving the soil with lots of organic matter before planting is invaluable – dig in a bucket of garden compost or well-rotted manure per square metre/yard.  This will help add nutrients, improve the soil structure and hold moisture in the soil.  Avoid using fresh manure.  Also add a high potassium general fertiliser, such as Vitax Q4, at a rate of one handful per square metre/yard. \n\nPlant the sets 2cm (¾in) deep in drills or gently push them into loose soil, so the tip is just showing at the surface.  Space them 5–10cm (2–4in) apart, in rows 25–30cm (10–12in) apart.  Firm the soil around them and water well.  Birds can be a problem lifting newly planted sets, so cover with fleece until they’ve rooted in. \n\nAnother planting option is to cover the ground with black weed-suppressing membrane, then plant the sets through slits.  There is then no need for weeding, which both saves time and avoids any accidental damage to the bulbs when hoeing. Autumn-planted sets are ready to harvest by early to mid-summer, while spring-sown or spring-planted onions are ready in late summer to early autumn.  Although it's sometimes suggested to bend over the foliage or gently lift the bulbs to break the roots, this is no longer recommended.  Yellowing and toppling of the foliage is a sign that the crop is reaching maturity.  Harvest before the foliage dies down completely.  Carefully lift the bulbs with fork, taking care not to damage or bruise them, as this could cause them to rot in storage.  Use any damaged onions straight away. Autumn-planted onions only store until early winter.  Spring-sown or planted onions can last until well into the following season. \n\nPlace the bulbs in a single layer on a wire drying rack or use slatted crates placed upside-down.  Ripen the bulbs in full sun outdoors for about two weeks, or in a greenhouse or well-ventilated shed if the weather is wet. \nWait until all the foliage is papery and dry before storing. \n\nPlace the onions in net bags or trays in a single layer, or tie the bulbs into plaits and hang up – store them in a light, cool, dry and well-ventilated place.  Don’t store them in the dark, as this encourages sprouting. A soil-borne fungus that can cause yellowing and wilting of the foliage above ground, while rotting the roots and invading the bulb beneath the soil.  A white fluffy fungus appears on the base of the bulb and later becomes covered in small, round black structures. There is no chemical cure for onion white rot when it is the soil.  It is important to avoid introduction to previously clean sites.  It is transported in contaminated soil, for example on tools or on muddy footwear.  Take particular care in areas where cross contamination can occur easily, for example on allotments. This is a fungal disease causing bright yellow spots on the leaves.  It is often worse in long, wet spells. Mild attacks of rust won’t harm the plant, but serious infections may cause leaves to shrivel and affect yield.  There is no control for rust once you have the infection.  Make sure you don’t crowd plants, as this increases humidity and increases the likelihood of infection.  Dispose of any badly affected plant material, and don’t grow garlic, leeks or onions in the same spot for three years. A fungal disease that damages foliage and bulbs, resulting in poor yields.  It is a particular problem in damp conditions. Avoid problems by make sure there is plenty of light and air around plants by sowing or planting at correct spacings, and by regular weeding.  Avoid overhead watering if possible.  Infected leaves can be removed. Plants flower and set seed prematurely. Unless growing for seed sow bolt-resistant varieties.  Sow or plant at the correct time and keep the soil or compost moist. Fancy a tasty light lunch? This delicious onion tart is ideal. Onions are also an essential ingredient in the classic tapas dish patatas bravas, along with potatoes, tomatoes and chilli"
	},
	{
		"name": "Pak choi",
		"imgUrl": "https://www.rhs.org.uk/getmedia/b909727f-9ed3-4ac2-9084-910e41db3ae5/Pak-choi-%e2%80%98Summer-Breeze%e2%80%99-940x627.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [null, null, null, "Sow", "Harvest", "Harvest", "Harvest"],
		"desc": "Pak choi can be used in salads or stir-fries as baby leaves, or as a cooked vegetable in various Oriental dishes when semi-mature or fully grown. Sow outdoors from April to July in a sunny position in fertile soil.  Sow seeds thinly, 2cm (¾in) deep, in rows 30–38cm (12–15in) apart – the wider distance is best for growing semi-mature to full-sized plants. Earlier and later sowings, to produce baby leaves, can also be made under cloches or fleece in mild areas. Gradually thin out seedlings to prevent overcrowding and give them more room to grow.  You can use the thinnings in salads.  The final spacings depend on what stage you're going to harvest them:7. 5–10cm (3–4in) apart for baby leaves20cm (8in) apart for semi-mature plants25–30cm (10–12in) apart for mature plantsKeep plants well watered throughout the growing period to avoid bolting (flowering) and ensure they have a good flavour. Pak choi can be harvested from late spring to late summer, if repeated sowings are made. \n\nBaby leaves are ready to harvest in as little as 30 days, while semi-mature to full-sized heads take 45–75 days. Leaves are covered in small holes and damaged areas turn brown.  Seedlings are particularly susceptible. Grow plants under horticultural fleece and keep the soil moist.  Water in nitrogen-rich fertilser to help the crop outgrow the pest. Appears as a white powdery deposit over the leaf surface and leaves become stunted and shrivel. Keep the soil moist and grow in cooler locations. Plants flower and set seed prematurely. Unless growing for seed sow bolt-resistant varieties.  Sow or plant at the correct time and keep the soil or compost moist"
	},
	{
		"name": "Parsnips",
		"imgUrl": "https://www.rhs.org.uk/getmedia/d0b65739-401d-4163-9339-979514b15763/parsnip_WSYD0014255.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [
			"Harvest",
			"Harvest",
			"Sow",
			"Sow",
			"Sow",
			null,
			null,
			"Harvest"
		],
		"desc": "A roast dinner isn’t complete without roast parsnips – and they add a whole new dimension to stews and casseroles too.  The good news is that parsnips are easy to grow, need little maintenance and can be left in the ground until you’re ready to use them.  Sow in spring and you’ll have parsnips in the autumn. Parsnips prefer an open, sunny site with deep, light soil. \n\nSow seeds thinly, or sow three at 15cm (6in) intervals, 13mm (½in) deep, in rows 30cm (1ft) apart. Although it’s sometimes recommended to start sowing in February, this can lead to failure.  Sowings made in March and April, and even early May, will often do much better.  Warm the soil before sowing with cloches or similar, and leave in place until the seedlings have developed two true leaves. When seedlings are about 2. 5cm (1in) high, thin out to leave one every 15cm (6in). Keep the soil weed free, hand weeding rather than hoeing close to the plants, to avoid damaging the top of the root.  \n\nKeep the soil evenly moist to prevent roots splitting. The roots are ready to lift when the foliage starts to die down in late summer or autumn.  Use a garden fork to carefully ease them out of the ground. \n\nRoots can be left in the ground and harvested as required, although lifting a few extra in November will ensure you still have parsnips to eat even if the soil is frozen.  Lightly frosted roots tend to have the best flavour. Parsnip canker: This orange, brown or purple-coloured rot usually starts at the top of the root.  It is mostly caused by drought, over-rich soil or damage to the crown. Remedy: Sow resistant cultivars such as ‘Avonresister’ and ‘Archer’, improve drainage and avoid damaging the roots.  Avoid sowing seeds too early in the year.  Protect from carrot fly. Carrot fly is a small black-bodied fly whose larvae feed on the roots of carrots.  The larvae tunnel into the developing carrots causing them to rot. Once you have an attack of carrot fly, there is nothing you can do to get rid of this pest.  Prevention is the best cure, and you should sow thinly and avoid crushing the foliage as you thin out seedlings or hand weed.  You can surround your carrots with 60cm (2ft) high barriers made of clear polythene which will exclude the low-flying female flies, or cover the plants with horticultural fleece, such as Enviromesh"
	},
	{
		"name": "Peas",
		"imgUrl": "https://www.rhs.org.uk/getmedia/9685aeb0-6d30-4ff5-9711-1d77ffc81652/Peas_WSYD0018492;Peas.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [
			null,
			"Sow",
			"Sow",
			"Sow",
			"Sow",
			"Harvest",
			"Harvest",
			"Harvest"
		],
		"desc": "There’s nothing like the flavour of freshly picked peas – use them as quickly as possible after picking for maximum sweetness.  The easiest types to grow are mangetout and sugar snap varieties, while dwarf varieties need little or no supports. Peas are easy to grow from seed sown in spring and into early summer, either outdoors where they are to grow, or indoors to get them off to an early, reliable start. When choosing varieties to grow, bear in mind that round peas tend to be hardier than wrinkled varieties.  Mangetout and sugarsnap varieties are generally the easiest to grow. \n\nDifferent types of peas mature at different rates:First earlies are sown from March to early June and will be ready to pick in 11 to 13 weeksSecond earlies are sown from March to June and are ready in around 14 weeksMaincrop cultivars are sown from March to June and take up to 16 weeksPeas prefer an open, sunny position with good drainage.  If your soil is acidic, then add lime before sowing. \n​Sowing in February or March allows you to get an early start, and helps to protect the seeds from being eaten by mice. \n\nPeas are best sown along a length of guttering filled with compost, spacing seeds about 7. 5cm (3in) apart.  This makes transplanting outside easy, as you have a ready-made row that can simply be slid into a trench.  Alternatively, sow in modular trays or small pots. \n Never sow into cold, wet soil.  If spring is slow to arrive, warm the soil with polythene or cloches before sowing, then protect seedlings with horticultural fleece.  Still, peas generally prefer cooler weather and grow well in a cool spring. \n\nMake a flat-bottomed trench 5cm (2in) deep and 15cm (6in) wide – a draw hoe is ideal for this.  Sow the seeds evenly in the trench about 7. 5cm (3in) apart, cover with soil, then lightly firm. \n\nIf you sow a second row, space it at a distance equal to the height of the crop. Water the plants when they start to flower and two weeks after.  Add a thick mulch around the base of the plants to help prevent the soil drying out. Most peas, apart from dwarf cultivars, need supports to scramble up.  For taller varieties, trellis, bamboo canes and netting are ideal, while smaller varieties can be supported with pea netting or pea sticks (twiggy branches). After flowering, plants need sufficient water for the pods to swell.  Check the soil moisture at root level regularly and water if necessary. By choosing different types and cultivars, you can harvest from June through to October. Pods are ready to harvest when they’re well filled.  Pick regularly, otherwise the plants will stop producing flowers and pods. Mangetout and sugarsnap peas should be picked when the pods are about 7. 5cm (3in) long, just as the peas are starting to develop. This is the caterpillar that you find when shelling your peas.  Female moths lay their eggs on peas that are in flower. Early or late peas, flowering outside their flying period, are undamaged, which means March and June sowings are best.   Grow under insect-proof mesh. These rodents will eat the seeds where plantedTrapping can be effective for mice in a garden situation, although voles can be harder to control.  Break-back traps of the type used against house mice can be effective when set in places where damage is occurring.  Pieces of carrot or dessert apple are effective baits for voles, and peanut butter for mice.  When using traps or baits out of doors, they must be placed under covers to reduce the risk of other animals interfering with them.  Birds are particularly vulnerable to accidental trapping. Wood pigeons are often the worst bird pest in gardens and on allotments.  They peck at leaves, tearing them, sometimes only leaving the stalks.  Pigeons can attack many plants, but particularly brassicas and peas. The only certain way of protecting vulnerable plants from pigeons is to grow them under netting or in a fruit cage.  Scaring devices or repellent substances are likely to give, at best, only temporary protection.  Larger plants such as established lilacs will usually recover from pigeon damage and so it can be tolerated.  Appears as a white powdery deposit over the leaf surface and leaves become stunted and shrivel. Keep the soil moist and grow in cooler locations. Nigel Slater teams fresh peas with lentils and goats’ cheese in this delicious warm salad"
	},
	{
		"name": "Peppers",
		"imgUrl": "https://www.rhs.org.uk/getmedia/e78db8ed-168a-4569-95fd-997fa287d5ce/Capsicum-display_PUB0007109.jpg?width=697&height=940&ext=.jpg",
		"monthlyJob": [
			null,
			"Sow",
			"Sow",
			"Sow",
			null,
			"Harvest",
			"Harvest",
			"Harvest"
		],
		"desc": "With their glossy fruits in an array of colours, shapes and sizes, sweet peppers are a vibrant and attractive crop.  These tender plants are best grown in a greenhouse, as they need warm conditions, but can also be planted outdoors in a sheltered, sunny spot, in containers or in the ground. Sweet peppers are tender and need warmth and full sun, so are best grown under cover in the UK, in a greenhouse, polytunnel, conservatory or coldframe.  They are only really successful outdoors in milder parts of the country, and benefit greatly from cloche or fleece protection.  Wherever you’re ultimately going to grow them, they need to be sown in warmth indoors. \n\nSow seeds from mid-February to early March for plants that are to be grown under glass, and in late March or early April for growing outdoors. \n\nSow into small pots or seed trays filled with moist seed compost and cover with a thin layer of vermiculite.  Most seeds will germinate, so only sow a few more than you need, in case of losses. \n\nPlace in a heated propagator at about 18–21°C (65–70°F), or on a warm windowsill and cover pots with a clear plastic bag or clear lid to keep the warmth and moisture in. \n\nAs soon as seedlings appear, take the pot out of the propagator or remove the plastic bag.  Keep plants at 16–18ºC (60–64ºF) in good light and water regularly. \n\nTransplant seedlings once they have two true leaves into their own 7. 5–9cm (3–3. 5in) pot, maintaining a high temperature to encourage growth. If you don’t have time to grow peppers from seeds, or don’t have a suitably warm, bright place to raise good plants, then buy young plants from garden centres in late spring and early summer.  Grafted plants can also be ordered online for delivery from mid-April onwards – these more vigorous plants are particularly useful where growing conditions are a little cool. Sweet peppers grow best in a greenhouse, polytunnel or conservatory, but will also grow outdoors in a very warm, sheltered, sunny spot (at the base of a wall for instance), but may produce a smaller crop.  Each plant needs a large container – 30cm (12in) or more – filled with good quality potting compost.  They can also be planted in growing bags (two or three plants per bag) or in the ground. \n\nMove young plants into their final container in late April if growing in a heated greenhouse, mid-May in an unheated greenhouse, or late May/June to grow outside.  These plants are tender, so only take them outside once there is no danger of frost.  Pepper plants must first be acclimatised to outdoors conditions, by hardening off for two to three weeks, before planting out. \n\nPlants will tolerate a minimum night temperature of 12ºC (54ºF), but do best if the temperature never drop below 15ºC (59ºF). \n\nBefore planting in the ground, warm the soil with polythene or cloches for two weeks.  Choose your warmest, sunniest spot.  Peppers like fertile, well-drained but moisture-retentive soil that is slightly acid.  So dig well-rotted manure – at a rate of 5. 4kg (10lb) per square metre/yard – into the soil before planting, but avoid using fresh manure or large quantities, as this promotes leafy growth at the expense of fruit.  Water little and often to keep the soil or compost evenly moist.  Don't let plants dry out or get waterlogged.  Mulch the soil surface to help retain moisture. \n\nPlants in containers need regular and generous watering, as the compost dries out rapidly.  But never leave the pots standing in trays of water. \n\nKeep humidity high in greenhouses by damping down twice a day during hot weather.  Temperatures above 30ºC (86ºF) may reduce cropping, so keep greenhouses well ventilated. To boost cropping, feed with a high-potassium liquid fertiliser weekly once flowering starts. Pinch out the growing tip when plants are about 20cm (8in) tall, to encourage branching, which should lead to more fruit.  \n\nSide-shoots (the shoots forming between the main stem and leaves) can be further pinched back if you want even more but smaller fruits. You may need to stake plants if they produce a heavy crop of large peppers. In a greenhouse, sweet peppers can be harvested from mid-summer into autumn.  Outdoors, they will start fruiting later, usually in August, and finish earlier, once temperatures start to drop in late summer or early autumn. \n\nPick as required when the fruits are swollen and glossy.  Most peppers ripen from green to red, but other colours, including yellow, orange and purple, are available.  Harvest at whichever colour and stage of maturity you prefer, but bear in mind that leaving peppers on the plant to ripen fully will hinder further fruit development. Leaves become mottled, pale and covered in webbing, on which the mites can be clearly seen; leaves also drop prematurely. They thrive in hot, dry conditions, so mist plants regularly.  Use biological control in the greenhouse. Look for colonies of greenfly on the soft shoot tips of plants or on leaves.  They suck sap and excrete sticky honeydew, encouraging the growth of black sooty moulds. Use your finger and thumb to squash aphid colonies or use biological control in the greenhouse. Dark blotches appear on the ends. Water regularly and not sporadically and never allow the soil to dry out. Small white flies suck sap and excrete sticky ‘honeydew’ over the plant, encouraging the growth of sooty mould. Use biological control or sticky traps in the greenhouse. Gregg Wallace tempts us with his grilled vegetable terrine"
	},
	{
		"name": "Potatoes",
		"imgUrl": "https://www.rhs.org.uk/getmedia/556b1f9e-b456-4ba1-bcf3-bf9b908be955/potato-selection940x627.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [
			null,
			null,
			"Plant",
			"Plant",
			"Plant",
			"Harvest",
			"Harvest",
			"Harvest"
		],
		"desc": "Potatoes are hugely versatile and a staple ingredient of many meals in one form or another – boiled, mashed, chipped or baked.  Potatoes are classified as being either earlies or maincrops.  Early varieties are ready to harvest much sooner than maincrops and are what we call ‘new potatoes’.  Maincrop varieties are in the ground a lot longer.  They produce a larger harvest and bigger potatoes. Potatoes are grown from specially prepared ‘seed’ potatoes (or tubers).  These are just like potatoes you buy from the supermarket, but they’re certified virus-free.  You can buy seed potatoes from late winter onwards.  You then start them off indoors by letting them sprout, before they are planted. It’s important with earlies, and a good idea with maincrops, to ‘chit’ the seed potatoes before planting.  This means allowing them to start sprouting shoots. \n\nStand them rose end up (the end with the most small dents, or eyes) in egg boxes or trays in a light, frost-free place.  The potatoes are ready to plant when the shoots are about 3cm (1in) long.  With early potatoes, rub off the weakest shoots, leaving four per tuber. Potato plants need ‘earthing up’ as they grow, to protect early shoots from frost damage and ensure the developing potatoes aren’t exposed to light, which turns them green and poisonous. \n\nIt’s a simple process – once the stems are about 23cm (9in) tall, draw soil up around them, creating a ridge about 15cm (6in) high.  As the stems grow, repeat the process several times.  The final height of the ridge should be 20–30cm (8in–1ft). Keep the plants well watered in dry weather – particularly once the tubers start to form.  Maincrop potatoes benefit from a nitrogen-rich fertiliser around the time of the second earthing up. Planting time varies, depending on the type of potato you’re growing:First earlies – around late MarchSecond earlies – early to mid-AprilMaincrops – mid- to late AprilThe timing also depends on where you are in the country – planting should be slightly later in colder regions and can be earlier in milder ones.  And when growing in containers, you can plant earlier too. Potatoes need a sunny site.  Avoid planting in a spot prone to late frosts, as the newly emerging foliage is susceptible to frost damage in April and May.  \n\nPrepare the ground, ideally the previous autumn or winter, by digging in plenty of organic matter such as garden compost or well-rotted manure. The traditional planting method is to dig a narrow trench 12cm (5in) deep.  Space the tubers 30cm (1ft) apart for earlies and 37cm (15in) for maincrops, in rows 60cm (2ft) apart for earlies and 75cm (30in) apart for maincrops.  Apply a general-purpose fertiliser at this stage. Gardener, blogger and allotmenteer Bryony Willis, shows you how to plant early potatoes. Potatoes can also be grown under black polythene sheets.  The tubers are planted through slits in the polythene.  The advantages of this method are that there is no need to earth up, and new potatoes form just below the surface, so there’s little or no need to dig. Small crops of potatoes can also be grown in large, deep containers.  This is a good way to get an early batch of new potatoes.  Fill the bottom 15cm (6in) of the container with potting compost and plant one seed potato just below this.  As the new stems start growing, keep adding compost until the container is full. First early potatoes should be ready to lift in June and JulySecond earlies in July and AugustMaincrops from late August through to OctoberWith earlies, wait until the flowers open or the buds drop.  The tubers are ready to harvest when they’re the size of hens’ eggs. With maincrops for storage, wait until the foliage turns yellow, then cut it down and remove it.  Wait for 10 days before harvesting the tubers, and leave them to dry for a few hours before storing. This is a common disease in wet, warm summers.  The initial symptoms are a rapidly spreading brown watery rot, affecting leaves, and stems.  Tubers can be affected too, and have a reddish-brown decay below the skin, firm at first but soon developing into a soft rot. Unfortunately once blight starts, it is very difficult to stop.  You can remove blight-affected leaves, but removing too many leaves will damage the plant’s ability to grow.  Earthing up potatoes provides some protection to tubers.  Try blight resistant cultivars or stick to earlies which are usually harvested before blight strikes. Potato blackleg is a common bacterial disease which causes black rotting at the stem base.  Initial infections cause stunted growth and yellowing stems.  If tubers form, the flesh may be grey or brown and rotten. Remove and destroy infected plants.  Rotate crops.  Buy resistant varieties such as 'Charlotte', 'Pixie' and 'Saxon'. This disease causes raised scab-like lesions on the potato surface.  It does not affect the taste of the potato, and is easily removed on peeling. There is no control for scab, and you usually won’t know anything is wrong until harvest time.  Scab can be worse in dry weather, so keep potatoes well watered.  Don’t store any potatoes with scab. Potato tuber rots are a frequent cause of losses prior to, or after, lifting.  Significant problems often follow a wet growing season, particularly if the tubers are then lifted from wet soil. Use good quality, resistant certified seed tubers when planting and harvest when the soil is neither wet nor very hard and dry.  Store in cool, dry conditions. Nigel Slater suggests roasting young potatoes – although this may sound like an odd thing to do, it brings out their fudgy texture and crisp, papery skins"
	},
	{
		"name": "Pumpkins",
		"imgUrl": "https://www.rhs.org.uk/getmedia/cdc20cb8-a1a7-4df2-b29b-87bfc533feef/Assorted-pumpkins-and-squashes_WSYD0017895.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [null, null, null, "Sow", "Sow", null, null, "Harvest"],
		"desc": "Pumpkins are easy and fun to grow – just give them a sunny position, plenty of water and shelter from cold winds.  One of the finest sights of autumn is colourful pumpkins ripening in the sun.  As well as making great Halloween decorations, the fruits can be used to make hearty soup and are delicious roasted. \n Pumpkins are best grown from seed indoors, but can also be sown later outdoors in a sheltered spot. For earlier crops or in cold regions, sow seeds indoors in 7. 5cm (3in) pots from mid- to late April.  Sow the flat seeds on their side, 1cm (½in) deep, and keep at 18–21°C (65–70°F). If you don’t have the space to raise pumpkin seedlings indoors, you can often buy young plants in garden centres in spring. You can also sow seeds directly outdoors where you want your plants to grow.  Sow two or three seeds per planting hole, 3cm (1in) deep, in late May or early June.  Cover with cloches, jars or plastic sheeting.  Leave this in place for two weeks, or as long as possible, after germination.  Thin the seedlings, leaving only the strongest one to grown on. Pumpkins need a warm, sunny position, shelter from cold winds and moisture-retentive soil. \n\nIn late May, start hardening off indoor-raised plants, to acclimatise them to outdoor conditions.  Do this by moving them into a coldframe for a week.  If you don’t have a coldframe, move plants outdoors during the day, then bring them in at night for a week.  The following week, leave them out in a sheltered spot all day and night.  Plant them out in early June, when all risk of frost has passed. \n\nBefore transplanting indoor-raised plants or sowing seeds outdoors, prepare the planting site by making a hole about a spade’s depth and width.  Backfill with a mixture of garden compost or well-rotted manure and soil.  Sprinkle a general purpose fertiliser, such as Vitax Q4 over the soil at a rate of two handfuls per square metre/yard.  Space these planting or sowing sites 1. 8m (6ft) apart.  \n\nYou can also plant pumpkins in growing bags or large containers (at least 45cm/18in wide), but bear in mind that they’ll need regular and generous watering.  Plant one or two per growing bag, or one per container.  Pumpkins need plenty of water.  To make watering easier, sink a 15cm (6in) pot alongside each plant.  Water into this to ensure the water goes down to the roots and doesn’t sit around the neck of the plant, which can lead to rotting. Feed every 10–14 days with a high potassium liquid fertiliser, such as tomato feed, once the first fruits start to swell. Support developing fruits on a piece of tile or glass, to keep them off the damp soil. Let the pumpkins mature and colour up on the plant before picking in autumn.  They can be used straight away or stored for use in winter. \n\nHarvest before the first frost, or protect the fruits using straw, fleece or cardboard, as frosted fruit can’t be stored. \n\nIf storing, place the pumpkins in the sun for a week, either outdoors or in a greenhouse, to harden (or cure) the skins.  This helps to ensure they keep well. \n\nStore your pumpkins in a well-ventilated place indoors at 10–15°C (50–60°F). \n\nDepending on the variety, pumpkins should keep for at least three months, and up to six months in ideal conditions. Appears as a white powdery deposit over the leaf surface and leaves become stunted and shrivel. Keep the soil moist and grow in cooler locations. This is a physiological problem, caused by the growing conditions, not a pest or disease.  It is a problem when the weather in early summer is cool and this causes inadequate pollination. This is usually a temporary problem and once the weather starts to improve, so will pollination.  You can try to hand-pollinate plants yourself by removing a male flower (no swelling at their base) and brushing the central parts against the centre of a female flower (female flowers have a swelling at the base – this is the beginning of the fruit).  But this is a bit of a hassle, and normally the plant will correct this problem itself. A usually grey, fuzzy fungal growth which can begin as pale or discoloured patches.  Grey mould ( botrytis) is a common disease especially in damp or humid conditions.  Spores enter plants via damaged tissue, wounds or open flowers.  Mould can also damage ripening fruit such as strawberries.  Black resting spores survive over winter. Remove damaged plant parts before they can become infected.  Cut out infected areas into healthy tissue and clear up infected debris.  In greenhouses, reduce humidity by ventilating and avoid overcrowding of young plants and seedlings. Why not try making pumpkin cake? You can use pretty much any kind of pumpkin, and it’s a delicious, autumnal alternative to carrot cake"
	},
	{
		"name": "Radishes",
		"imgUrl": "https://www.rhs.org.uk/getmedia/db12e66c-6af7-4b8e-a7c0-573c219ccdcc/Radishes_PUB0004103.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [
			"Harvest",
			"Harvest",
			"Sow",
			"Sow",
			"Harvest",
			"Harvest",
			"Harvest",
			"Harvest"
		],
		"desc": "Radishes are quick, easy and fun to grow from seed, ready to eat in as little as four weeks.  These compact plants can be grown in even the smallest of gardens and are great gap-fillers on the veg plot.  Sow small batches every few weeks for harvesting throughout summer, to add a crunchy tang to your salads.  There are even varieties for winter cropping. It’s best to sow radish seeds little and often, for small but continuous harvests.  Aim to provide consistent conditions to ensure they grow well without any checks to their growth. \n\nSow outdoors, in the spot where they’re to grow.  This can be in the ground, in containers or even in a growing bag.  Sow seeds in short drills, 1cm (½in) deep and about 2. 5cm (1in) apart. \n\nFor an early crop, sow in February into pre-warmed soil and protect with cloches. \n\nSow summer cultivars from March to mid-August. \n\nWinter cultivars should be sown in July or August – space seeds 23cm (9in) apart to minimise the need for thinning later on.  If sowing more than one row, keep them 15cm (6in) apart. Thinning shouldn’t be necessary if you sow summer cultivars 2. 5cm (1in) apart and winter cultivars 15cm (5in) apart.  If thinning is required, do it as soon as possible.  Keep the soil moist to ensure rapid growth, for fleshy, tasty roots that don’t split.  This can be tricky in hot dry summer weather, so take care to water regularly.  Because radishes are quick to mature, they can be sown as a ‘catch crop’  between rows of slower-growing vegetables such as peas and potatoes. \n\nThey can even be used as row markers for slow-germinating crops, such as parsnip and onions – the radishes germinate quickly, marking out the row where the other crops have been sown, and are harvested before they can hinder the main crop. Summer radishes are best harvested young, in as little as four weeks from germination, when the roots are about 2. 5cm (1in) in diameter.  If left to grow too large, they can become woody and inedible. Pull as required, and eat fresh, when crunchy and delicious. \n\nWinter radishes can be left in the ground and dug up as required, or lifted in November and stored. Leaves are covered in small holes and damaged areas turn brown.  Seedlings are particularly susceptible. Grow plants under horticultural fleece and keep the soil moist.  Water in nitrogen-rich fertilser to help the crop outgrow the pest. These feed on the young seedlings and you'll see the tell tale slime trail on the soil around your crop, as well as on the leaves. There are many ways to control slugs and snails, including beer traps, sawdust or eggshell barriers, copper tape and biocontrols. This is a common disease of brassicas, as they are not in the ground so long.  The leaves will turn yellow, with white, fuzzy patches on the undersides.  The root may also turn brown. Remove infected plants as soon as you see them.  Don’t plant brassicas in the same place as previous brassica crops. Nigel Slater suggests a radish, mint and feta salad for a summer lunch full of freshness and vitality"
	},
	{
		"name": "Rhubarb",
		"imgUrl": "https://www.rhs.org.uk/getmedia/dfadd5c4-6d5e-4229-8fe6-586007629f86/Rhubarb_PUB0004180.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [
			"Plant",
			"Plant",
			"Harvest",
			"Harvest",
			"Harvest",
			"Harvest"
		],
		"desc": "Rhubarb is an attractive hardy perennial with large leaves and pink, red or greenish leaf stalks that are used as a dessert, often in pies and crumbles.  Stems are usually picked in spring, but plants can be covered with pots to produce an early crop of blanched stalks in late winter.  The flavour of rhubarb varies in sweetness depending on the age of the stems.  Rhubarb is extremely easy to grow, and plants crop well for many years. \n Rhubarb needs an open, sunny site with moist, but free-draining soil, as it dislikes being waterlogged in winter.  Avoid planting in sites that are particularly prone to late frosts, as the young stems may be damaged. Rhubarb can be grown from seed, but it’s more common to plant dormant crowns between autumn and spring.  You can also buy plants in pots in active growth – these can be planted at any time of year, but it's best to avoid planting in hot dry weather.  \n\nPrepare the planting site by digging in two bucketfuls of well-rotted manure per square metre/yard.  Then dig a planting hole and position the plant so the tip of the crown is just visible above the soil.  If planting more than one, space them 75–90cm (30–36in) apart. \n\nRhubarb can also be planted in very large pots, at least 50cm (20in) deep and wide. With newly planted rhubarb, resist the temptation to harvest any stems in the first year, as this will reduce the plant’s vigour.  The following year, pick just a few stems.  After that, the plant should be well established and can be harvested normally.  \n\nOn established plants, stalks can be picked from March or April onwards for early cultivars, and late April or May onwards for maincrop varieties.  Although the stems remain edible and tasty through summer, it’s best to stop harvesting by June, or at least only take a few stalks after then, so you don’t over-harvest and weaken the plant. \n\nTo harvest, hold the stalk at the base and ease it out of the ground – try to avoid snapping it off. \n\nOnly ever take about a third of the plant's stems, so there are plenty left to keep it in active growth. Forced rhubarbEarlier harvests of sweeter, tender, pale stems can be produced by covering rhubarb plants with a forcing jar or bin in late winter, so the stalks form in the dark.  They can be ready to harvest as early as March, several weeks before plants left to grow normally. Crown rot: This is a common problem caused by various soil- or water-borne fungi or bacteria.  Plants look sickly, fail to grow and rot at the crown.  This can spread to the stems and leaves, causing the plant die. Remedy: Prompt action may save the plant.  Remove affected areas by cutting well back into healthy tissue. These feed on the young seedlings and you'll see the tell tale slime trail on the soil around your crop, as well as on the leaves. There are many ways to control slugs and snails, including beer traps, sawdust or eggshell barriers, copper tape and biocontrols. Nigel Slater's roast rhubarb, which is allowed to brown slightly, creates a delicious mixture of sweet and tart.  Best served with vanilla ice cream or frozen yoghurt"
	},
	{
		"name": "Rocket",
		"imgUrl": "https://www.rhs.org.uk/getmedia/ada7442e-1241-4dfb-a912-67fe5861b9cd/Salad-rocket940x627.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [
			null,
			null,
			null,
			"Sow",
			"Sow",
			"Harvest",
			"Harvest",
			"Harvest"
		],
		"desc": "Rocket is an easy-to-grow crop that adds a lovely peppery flavour to salads.  The younger leaves are milder, more tender and delicately flavoured.  Older leaves can also be lightly cooked as a spinach substitute, added to sauces, stir-fried or sautéed in olive oil.  The flowers are edible too.  Rocket is rich in potassium and vitamin C and flourishes in a warm, sunny position. Rocket likes in a sunny site with rich, fertile, well-drained soil.  It also grows well in containers. \n\nSow direct outdoors from April to early September, scattering the seeds thinly along a drill, 0. 5–1cm (¼–½in) deep.  If sowing several rows, space them 15cm (6in) apart. \n\nFor a continuous supply of leaves, sow small batches every two to three weeks. \n\nThin out the seedlings to 15cm (6in) apart when they’re large enough to handle, and use the thinnings in salads. \n\nIf you allow some plants to flower and produce seeds, they’ll self-sow to give you new plants without any effort. \n\nFor autumn and winter crops, sow in August and September in a cool greenhouse or under cloches or fleece. Keep the soil moist, watering in dry spells, to ensure consistent growth and prevent plants running to seed (bolting) prematurely.  However, take care not to overwater, as this can dilute the taste.  \n\nWeed between the plants regularly. It’s best to give rocket some shade in hot weather, to prevent the leaves becoming tough and unpalatable.  Cover with fleece or make summer sowings in a spot that gets some light shade. Rocket can provide pickings from early summer through autumn and into winter, if repeat sowings are made. \n\nYou can start harvesting the leaves from about four weeks after sowing.  Regular picking keeps growth young, tender and tasty. Pick a few leaves from each plant along the row.  If you take lots of leaves from just one plant, you’ll weaken the growth. As flower buds appear, pinch them out to prolong cropping, unless you want the plant to produce seeds.  The flowers are edible and can be used as a garnish for salads. Leaves are covered in small holes and damaged areas turn brown.  Seedlings are particularly susceptible. Grow plants under horticultural fleece and keep the soil moist.  Water in nitrogen-rich fertilser to help the crop outgrow the pest. Plants flower and set seed prematurely. Unless growing for seed sow bolt-resistant varieties.  Sow or plant at the correct time and keep the soil or compost moist. Use your home-grown rocket leaves in all kinds of salads, including this delicious combination: roasted squash, sheep’s cheese and hazelnut salad"
	},
	{
		"name": "Runner beans",
		"imgUrl": "https://www.rhs.org.uk/getmedia/0d4902ff-7ba2-47b9-9637-2ca7d80070b5/Runner-beans-Phaseolus-coccineus-Liberty_WSYD0006493.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [
			null,
			null,
			null,
			"Sow",
			"Sow",
			"Harvest",
			"Harvest",
			"Harvest"
		],
		"desc": "Runner beans are a delicious veg plot staple – they’re one of the easiest crops to grow and produce an abundance of long green pods over several months.  Most varieties are climbers, grown up tall canes, producing large harvests in a small area.  A few dwarf varieties are also available, ideal for large containers.  Pick when young, for tasty stringless beans. Runner beans are tender plants that won’t survive frost, so for an early crop sow indoors in late spring.  You can also sow outdoors in early summer.  Alternatively, young plants can be bought from garden centres and online suppliers in spring, ready for planting outside. \n\nMost runner beans are climbers – they need tall, sturdy supports and do best in the ground, but can also be grown in large containers.  As they grow vertically, climbers produce a large crop in a small area of ground.  There are also some dwarf varieties – these are quick to grow, but produce a smaller crop.  They are useful for raised beds and containers, and for gardens in exposed sites.  Climbing beans take longer to reach cropping stage, but produce beans over a longer period, from mid-summer to early autumn if picked regularly. \n\nRunner beans are attractive as well as productive, with red, white or bi-coloured flowers, depending on the variety. \n\nYou’ll find a huge range of varieties available as seed in garden centres and online.  Look in particular for varieties with an RHS Award of Garden Merit (AGM), which shows they performed well in trials – see our list of AGM fruit and veg. If you have space, start runner beans off indoors – on a sunny windowsill, in a propagator or in a greenhouse – from mid-April to May.  This will give you an earlier crop.  Choose pots 7–8cm (2. 5–3in) wide and fill with moist multi-purpose compost.  Sow one bean into the centre, 5cm (2in) deep, and water well. \n\nKeep in a warm, bright place, at over 12°C (54°F).  Seedlings will grow rapidly and need watering regularly.  \n\nThe young plants can be transplanted outside once all risk of frost has passed, usually in late May/early June – see Plant outside, below. You can sow seeds outdoors into pots of multi-purpose compost in spring – either into small pots for transplanting into the ground later, or into large containers as their final growing site.  \n\nSow one bean per small pot, 5cm (2in) deep, and place in a coldframe or sheltered position.  Once the plants reach 8cm (3in) tall, in June or July, plant them into their final positions – see Plant outside, below. \n\nAlternatively, sow into large containers, positioned in a sheltered, sunny spot, as their final growing site.  For dwarf beans the container should be 30–45cm (12–18in) wide, and for climbing beans 75cm (30in) wide and 45cm (18in) deep – a large tub or half-barrel is ideal. \n\nSimply sow the seeds direct into the container, spacing them 15cm (6in) apart.  Insert a wigwam of 1. 8m (6ft) canes to support climbing varieties (see Grow below), and choose a heavy container to keep it from toppling over.  Dwarf beans don’t usually need support and look great cascading over the sides. Runner beans thrive in rich, deep, fertile soil in full sun.  If possible, it’s best to improve the soil with organic matter the autumn before sowing.  Alternatively, it can be done a couple of weeks beforehand, to give time for the ground to settle.  A pH of 6. 5 (slightly acid) is preferable – add lime if your soil is more acidic.  Seeds need warm conditions to germinate, so wait until all risk of frost has passed and your soil has reached 12°C (54°F) – usually by mid-May in the south of the UK, and two weeks later in the north.  If your soil is heavy and wet, it can be pre-warmed in early spring by covering it with clear plastic or cloches for about four weeks before sowing. \n\nIt’s also best to put the supports in place first – usually tall bamboo canes in a wigwam or double row (see Grow below).  \n\nSow the large seeds individually 5cm (2in) deep – two at the base of each cane, which should be spaced 15cm (6in) apart.  Thin to one seedling per cane, and protect plants from slugs and snails. \n\nWhen sowing dwarf runner beans in the ground, allow 30cm (1ft) between plants and 50cm (20in) between rows. \n\nIf you sow one batch early (indoors in April/May), you can also sow a later batch outdoors in July, to prolong your harvests, allowing you to gather beans until the first frosts. Wait until after the last frost before planting indoor-raised or bought young plants outside.  Then harden them off to acclimatise them to outdoor conditions for a couple of weeks, either by putting them in a coldframe or placing them in a warm, sheltered spot, covered with fleece.  \n\nIf planting in the ground, enrich the soil with well-rotted manure or garden compost – ideally at least two weeks before planting, to give the ground time to settle.  Even better, do it the autumn before planting.  When growing in rows, the traditional method for preparing the soil is to dig a bean trench:Mark out a line, then dig a trench 90cm (3ft) wide and 60cm (2ft) deep.  Loosen the soil in the base by forking it overScatter well-rotted manure or home-made garden compost in the base of the trench and mix with the soil from the trench.  Return the improved soil to the trenchAdd pelleted poultry manure at the manufacturer’s recommended rate With climbing beans, it’s also best to put the supports in place before planting – see Grow, below. \n\nOnce your bean plants are hardened off, plant them into their final growing position, in the ground or in a large container, in a sunny, sheltered spot.  ​Water the plants well, both before and after planting.  \n\nPlant one climbing bean plant at the base of each cane, and loosely tie their stems to the canes to get them started.  When planting dwarf beans, space them 30cm (1ft) apart. \n \nIf planting in a container, choose multi-purpose or loam-based compost.  Containers should be at least 30–45cm (12–18in) wide for dwarf beans, and 75cm (30in) wide and 45cm (18in) deep for climbing beans. Runner beans need tall, sturdy supports to climb up.  The traditional method is to grow them up a double row of bamboo canes (1. 8m/6ft tall), with 45–60cm (18in–2ft) between the two rows.  Space the canes 15cm (6in) apart within each row and slope them inwards, then tie near the top to a horizontal cane, to form a sturdy A-frame.  If growing more than one double row, allow 1. 5m (5ft) between them. \n\nAlternatively, create an X-frame by sloping the canes at a sharper angle so they cross in the middle.  Tie them at the centre, and add a horizontal cane to link them all together and increase stability.  An X-frame takes up more space, but picking is easier and cropping is usually better. \n\nIf you don’t have room for a double row of canes, you can make wigwams.  Again, use 1. 8m (6ft) canes, four or five per wigwam, spacing them 15cm (6in) apart at the base.  Tie the tops of the canes together – or use cane support rings or ceramic finials to hold the canes together.  Wigwams make an attractive feature in a border or veg plot and also work well when growing in containers. \n\nLoosely tie young plants to the canes to get them started – after that they will climb naturally.  Remove the growing point once the plants reach the top of their support.  This encourages side-shoots and prevents plants becoming top-heavy. \n\nAnother support option is to use 10cm (4in) polyethylene pea/bean netting, secured to tall posts or placed over a frame. \n\nDwarf beans don’t usually need support, although you can insert short twiggy sticks between them to keep them upright and lift the beans off the ground. Runner beans are thirsty plants and crop best when watered regularly, especially once they start to flower and form pods.  You will typically need to apply 5–9 litres (1–2 gallons) of water per square metre/yard every three to four days.  Regular and generous watering is particularly important for plants growing in containers, which dry out more quickly. Spread a thick mulch of well-rotted manure or mushroom compost over the soil in July to help hold in moisture. Runner bean flowers sometimes fail to ‘set’ (produce pods) – there are several possible causes and solutions:Ensure the soil is constantly moist and doesn’t dry out.  Add mulch after planting and water regularly and generously, ideally in the evenings. Flower set is better in alkaline, chalky soil.  If your soil is neutral or acidic, try applying lime. If this is a recurring problem and you live in a mild area, try growing varieties with some French bean parentage, which set pods more easily in warmer summers.  Examples include ‘Firestorm’ and ‘Moonlight’. More on problems with runner bean flower setRunner beans are one of the easiest vegetables to grow.  However, a few pests and diseases can be problematic, one of the most common being black bean aphids.  Young plants also need protection from slugs and snails.  \n\nOccasionally, fungal or bacterial diseases such as rust or halo blight can develop, while in warm, dry conditions red spider mites may get established.  \n\nThe southern green shield bug is a relatively new pest found on runner beans and – although only in certain locations at present – is more serious than our native shield bugs, which do negligible harm to runner beans. \n Sap-sucking aphids will disfigure plants and cause stunting to leaves and stems. In the case of broad beans, pinch out infested tips.  On other beans, catch populations when small and squash. These feed on the young seedlings and you'll see the tell tale slime trail on the soil around your crop, as well as on the leaves. There are many ways to control slugs and snails, including beer traps, sawdust or eggshell barriers, copper tape and biocontrols. This is one of the most common problems of bean growing and is usually caused by lack of moisture and/or poor pollination by insects. Plant or sow beans into soil that has had plenty of organic matter, such as well-rotted manure added the previous autumn, as this will aid moisture and nutrient retention around the roots.  Plant in a sheltered site as this will encourage bees to visit and pollinate the plants. A common fungal disease of many plants that can be recognised by orange, yellow or black spots or blisters that form on leaves, along with pale and distorted stems.  Leaves can fall and in severe cases, plants will eventually die. Dig up badly infected plants and dispose of to prevent the spores spreading to other plants.  Carefully check plants before buying to ensure they are healthy and show no signs of disease. Nigel Slater recommends serving runner beans with lemon and garlic crumbs, as a lovely side dish for grilled fish"
	},
	{
		"name": "Salad leaves",
		"imgUrl": "https://www.rhs.org.uk/getmedia/d49f27d8-3c02-43d4-8d21-70975f7478c6/Salad-leaves-in-growing-bags-(l-to-r)-Mizuna-Kyoto-,-Pak-choi-Yuushou-,-Kale-Fizz-_PUB0021097.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [
			null,
			null,
			"Sow",
			"Sow",
			"Harvest",
			"Harvest",
			"Harvest",
			"Harvest"
		],
		"desc": "It's so quick and easy to grow your own salad leaves, even those exotic ones you see in the supermarket.  These are cut-and-come-again crops – regularly cut a few leaves from each plant and more re-grow.  The most popular crop is lettuce, but there are many other delicious choices, including chicory, endive, sorrel, spinach, mizuna, mibuna, rocket and mustard. Grow salad leaves in full sun and well-drained conditions.  They’re ideal in containers and growing bags, but also grow well in a veg plot or even just a handy gap at the front of a border. \n\nSow indoors in small pots or modular trays from February. \n\nSow outdoors from mid-spring through to late summer, at a depth of 1cm (½in), scattering the seeds thinly.  \n\nYou can either sow different types in individual rows or pots, or simply sprinkle a salad-leaf seed mix on a patch of bare soil or a compost-filled container, then cover with 1cm (½in) of compost. \n\nAs the seedlings grow, thin out a few to prevent overcrowding.  This gives the remaining plants more room to develop, and you can use the thinned seedlings in salads. \n\nYou should get three or four harvests from one sowing, so the secret to having salad leaves all summer is to sow several small batches, about a fortnight apart.  Then once one batch is finished, you can start the next. Water when the soil is dry, preferably in the early morning. Start harvesting leaves when the plants are about 10cm (4in) high, which can be just a month or so after sowing in some cases.  Snip off a few of the outer leaves with scissors, and more will grow from the centre, which will be ready to harvest a few weeks later. \n\nPick leaves just before you want to eat them, or store them in the fridge in a polythene bag for a couple of days. These feed on the young seedlings and you'll see the tell tale slime trail on the soil around your crop, as well as on the leaves. There are many ways to control slugs and snails, including beer traps, sawdust or eggshell barriers, copper tape and biocontrols. A usually grey, fuzzy fungal growth which can begin as pale or discoloured patches.  Grey mould ( botrytis) is a common disease especially in damp or humid conditions.  Spores enter plants via damaged tissue, wounds or open flowers.  Mould can also damage ripening fruit such as strawberries.  Black resting spores survive over winter. Remove damaged plant parts before they can become infected.  Cut out infected areas into healthy tissue and clear up infected debris.  In greenhouses, reduce humidity by ventilating and avoid overcrowding of young plants and seedlings. Older plants suddenly wilt and die back, usually in mid- to late sunmmer.  You may not see the aphids, as they attack the roots, not leaves, but you may see lots of ants around the plants, as they feed on the honeydew that the aphids produce. The damage is worse in dry conditions, so keep lettuce well-watered.  If you suspect root aphid and only have a few lettuces, you can pull them up, wash off the aphids and replant in fresh compost.  Otherwise, there is not much you can do, except pull up any affected plants and destroy them.  Prevention is the best cure, so cover lettuces with insect-proof mesh (like Enviromesh) from June until August as this will prevent aphids getting to the roots.  Some lettuces are resistant to root aphid"
	},
	{
		"name": "Salad onions",
		"imgUrl": "https://www.rhs.org.uk/getmedia/5baaf970-4140-4e31-8ebe-0c5958f135d7/salad-onions-940x627.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [
			null,
			null,
			"Harvest",
			"Harvest",
			"Sow",
			"Harvest",
			"Harvest",
			"Harvest"
		],
		"desc": "Salad or spring onions are easy to grow and take up little space, so can fit into even the smallest garden and do well in containers too.  They are best sown little and often for regular pickings, and can be used whole in salads or finely cut in soups and stir-fries. Sow from March onwards for summer harvests, and in late summer and early autumn for a spring crop.  \n\nSowing small batches every couple of weeks will give continual harvests through summer and early autumn. \n\nChoose a sunny site and prepare the ground by weeding and raking to remove lumps and stones.  Make a shallow drill, 1cm (½in) deep, then water along the base.  Sow the seeds thinly along the drill.  Space rows 10cm (4in) apart.   \n\nSeeds can also be sown in large containers filled with multi-purpose compost. Thin the seedlings, if necessary, until they are about 2. 5cm (1in) apart.  The thinnings can be used in salads. \n\nWater if the soil or weather is dry.  Spread mulch, such as garden compost, around the plants to hold moisture in the soil and keep weeds at bay. Lift individual plants whenever required – they’re best when small and young, about 15cm (6in) tall, with the bulb no more than 1–2. 5cm (½–1in) across. \n\nYou can harvest from spring through to autumn by making repeat sowings. A soil-borne fungus that can cause yellowing and wilting of the foliage above ground, while rotting the roots and invading the bulb beneath the soil.  A white fluffy fungus appears on the base of the bulb and later becomes covered in small, round black structures. There is no chemical cure for onion white rot when it is the soil.  It is important to avoid introduction to previously clean sites.  It is transported in contaminated soil, for example on tools or on muddy footwear.  Take particular care in areas where cross contamination can occur easily, for example on allotments. A fungal disease that damages foliage and bulbs, resulting in poor yields.  It is a particular problem in damp conditions. Avoid problems by make sure there is plenty of light and air around plants by sowing or planting at correct spacings, and by regular weeding.  Avoid overhead watering if possible.  Infected leaves can be removed. Salad onions join forces with garlic and ginger in this Thai-style brassica stir-fry"
	},
	{
		"name": "Spinach",
		"imgUrl": "https://www.rhs.org.uk/getmedia/743086ee-1ff9-448f-bf4c-69f911765cfa/spinach-Emilia3x2.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [
			"Harvest",
			"Harvest",
			"Harvest",
			"Harvest",
			"Harvest",
			"Harvest",
			"Harvest",
			"Harvest"
		],
		"desc": "Spinach is tasty, nutritious and easy to grow.  You can even enjoy harvests all year round if you grow several different types.  Winter cultivars need a sunny position, while summer varieties benefit from a little shade. Before sowing, enrich the soil by digging in up to two bucketfuls of garden compost per square metre (yard) and raking in a general fertiliser at a rate of 150g per square metre (5oz per square yard). \n\nSow outdoors, directly where they are to grow.  Make a drill 2. 5cm (1in) deep, then sprinkle the seeds thinly along it.  If sowing more than one row, space them 30cm (1ft) apart. \n\nYou can also sow seeds thinly in large containers. \n\nSow summer cultivars every few weeks:under fleece or cloches from Februaryunprotected from mid-March to the end of May Sow hardy winter cultivars in August and again in September. Thin out the seedlings to 7. 5cm (3in) apart when large enough to handle.  A few weeks later, harvest every alternate plant for use in the kitchen, giving the rest more room to grow. Keep well watered during dry periods in summer. Winter cultivars need protection from the cold from October onwards, except in mild areas of the UK.  Cover with cloches or protect the crown with straw, or similar material, and cover with fleece. Harvest the leaves continually once they’re large enough to pick:Summer cultivars – pick from late May to end of OctoberWinter cultivars – pick from October to AprilTo prevent the leaves tasting bitter, make sure the soil is rich by digging in plenty of organic matter, such as garden compost, before sowing. Birds, especially pigeons, can cause an array of problems including eating seedlings, buds, leaves, fruit and vegetables. Protect the plants from birds by covering them with netting or fleece.  Scarecrows and bird-scaring mechanisms work for a while, but the most reliable method of protection is to cover plants with horticultural fleece or mesh. Plants flower and set seed prematurely. Unless growing for seed sow bolt-resistant varieties.  Sow or plant at the correct time and keep the soil or compost moist. Spinach downy mildew attacks only spinach and is worst in mild, humid weather.  Well grown plants in gardens are not usually badly affected except in wet weather.  The felty mildew makes the leaves unappetising. You can help to prevent this disease by making sure there is plenty of space around plants to improve air circulation, watering the soil at the base of the plants, and by choosing mildew resistant varieties. Gregg Wallace, judge on TV’s Masterchef, thinks everyone should try his spinach and Roquefort tart"
	},
	{
		"name": "Squash",
		"imgUrl": "https://www.rhs.org.uk/getmedia/f098c479-f700-410e-83fb-099eafbd68cf/Winter-squash-Golden-Hubbard-_RHS-0002072.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [
			null,
			null,
			null,
			"Sow",
			"Sow",
			"Harvest",
			"Harvest",
			"Harvest"
		],
		"desc": "Squashes come in a huge range of shapes and sizes, from massive pumpkins to tiny patty pans.  There are winter squashes, such as pumpkins and butternuts, which can be stored, and summer squashes, which are harvested when immature and don’t store well.  They are all relatively easy to grow from seed. Squashes are usually sown indoors in pots, to get them off to an early start, then planted out after the last frost.  This will usually give you an earlier and larger crop, and is particularly useful in colder regions.  It also keeps the vulnerable seedlings safe from slugs and snails. \n\nFrom mid- to late April, sow the flat seeds on their side, 13mm (½in) deep, in 7. 5cm (3in) pots of compost and keep at 18-21ºC (65-70ºF). \n\nSeeds can also be sown outdoors in the spot where they are to grow in late May or early June. Sow two or three seeds at each sowing site, 2. 5cm (1in) deep, then cover with cloches, jars or plastic.  Leave in place for two weeks, or as long as possible, after germination.  Thin the seedlings to leave the strongest one.  If you want more than one plant, space your sowing sites about 90cm (3ft) apart. If you don’t have the space indoors to raise squashes from seed, you can buy young plants from garden centres in spring and these can usually be planted outdoors straight away.  Check plant labels for details. Before planting or sowing seeds outdoors, prepare the ground where each squash will grow.  Make a hole about a spade’s depth, width and height and fill with a mixture of home-made compost or well-rotted manure and soil.  Sprinkle a general purpose fertiliser, such as Vitax Q4, over the soil at a rate of two handfuls per square metre/yard.  Plant one squash or make one sowing in the middle. \n\nIf growing more than one squash, space bush plants 90cm (3ft) apart and trailing plants 1. 5m (5ft). \n\nYou can also plant summer squashes in growing bags or containers at least 45cm (18in) wide.  Plant one or two per growing bag, or one per container. \n\nIndoor-raised plants can be planted outside after the last frost in your area, but first you must harden them off to acclimatise them to outdoor conditions.  Do this by moving them into a coldframe for a week or, if you don’t have a coldframe, move them outdoors during the day, then bring in at night for a week.  The following week, leave them out in a sheltered spot all day and night. Keep the soil or compost constantly moist by watering around the plants, not over them.  As they need plenty of water, sink a 15cm (6in) pot alongside each plant, then water into it.  This ensures the water goes down to the roots and doesn’t sit around the neck of the plant, which can lead to rotting. Feed every 10-14 days with a high potassium liquid fertiliser, such as tomato feed, once the first fruits start to swell. Pumpkin fruits should be supported off the soil on a piece of tile or glass. Summer squash produce fruit for several months, from mid-summer onwards, sometimes right up to the first frost. \n\nHarvest their fruits when small and tasty, with a soft skin.  Regular picking will encourage further fruits to form. \n\nWith winter squashes for storing, let the fruit mature on the plant and remove before the first frost.  Ripen the skin until hard, by placing fruits in the sun for a week, either outdoors or in a greenhouse.  This helps to ensure they keep well. \n\nStore the fruits in a well-ventilated place indoors at 10–15°C (50–60°F). \n\nDepending on the variety, winter squash should keep for three months or more. Appears as a white powdery deposit over the leaf surface and leaves become stunted and shrivel. Keep the soil moist and grow in cooler locations. This is a physiological problem, caused by the growing conditions, not a pest or disease.  It is a problem when the weather in early summer is cool and this causes inadequate pollination. This is usually a temporary problem and once the weather starts to improve, so will pollination.  You can try to hand-pollinate plants yourself by removing a male flower (no swelling at their base) and brushing the central parts against the centre of a female flower (female flowers have a swelling at the base – this is the beginning of the fruit).  But this is a bit of a hassle, and normally the plant will correct this problem itself. A usually grey, fuzzy fungal growth which can begin as pale or discoloured patches.  Grey mould ( botrytis) is a common disease especially in damp or humid conditions.  Spores enter plants via damaged tissue, wounds or open flowers.  Mould can also damage ripening fruit such as strawberries.  Black resting spores survive over winter. Remove damaged plant parts before they can become infected.  Cut out infected areas into healthy tissue and clear up infected debris.  In greenhouses, reduce humidity by ventilating and avoid overcrowding of young plants and seedlings. Masterchef’s Gregg Wallace uses a pumpkin as a bowl for a delicious squash fondue – great for parties"
	},
	{
		"name": "Swedes",
		"imgUrl": "https://www.rhs.org.uk/getmedia/e3ed7124-ecfa-4efe-bc94-9f41d0e52279/SwedesMain.jpg?width=320&height=176&ext=.jpg",
		"monthlyJob": [null, null, null, null, "Sow", "Sow", null, "Harvest"],
		"desc": "Swedes (short for Swedish turnips) are extremely hardy and do well in cool, damp climates.  They need a constant supply of moisture to grow well and are happy in heavier soils.  Harvested in autumn and winter, swedes have a sweeter flavour than turnips – they’re delicious mashed with pepper or nutmeg and a little cream. Sow seeds outdoors from late spring to early or mid-summer, depending on your location – sow from early May in the north of the UK, and until mid-June in the south. \n\nChoose an open, sunny site with moist, free-draining soil that is very fertile, ideally with added garden compost or well-rotted manure, as well as fertiliser containing trace elements, such as Vitax Q4. Prepare the sowing site by weeding thoroughly, then raking the soil level and firming gently.  Swedes like a firm seedbed. \n\nSow the seeds thinly, 2cm (¾in) deep, in rows 38cm (15in) apart.  Thin out the seedlings when large enough to handle, leaving plants 23cm (9in) apart. \n Seeds can also be sown indoors in modular trays filled with multi-purpose compost.  Transplant outdoors when the roots fill the modules. Swedes are a long-term crop, taking up to six months to mature.  Keep the soil moist and weed-free throughout. Water during dry periods, but try to keep the soil evenly moist to prevent cracking and corky growth.  Dryness at the roots can also lead to a bitter taste. Lift swedes from September to November, once large enough to use, or leave in the ground until Christmas. \n\nCover with straw or bracken before the onset of cold weather.  In cold regions, store in containers of soil or potting compost in a shed or garage. Appears as a white powdery deposit over the leaf surface and leaves become stunted and shrivel. Keep the soil moist and grow in cooler locations. Roots become swollen and distorted, and leaves become pale and yellow and wilt easily.  Plants may die. Improve drainage and add lime to make soil more alkaline.  Do not grow in affected soil. White larvae approximately 5cm (2in) long, feed on the roots just below the soil surface, stunting growth and causing plants to wilt and die. Grow under insect-proof mesh or horticultural fleece.  Seedlings are most vulnerable"
	},
	{
		"name": "Sweet potatoes",
		"imgUrl": "https://www.rhs.org.uk/getmedia/a28497fe-fcbd-4cad-b4aa-489cbab12722/Ipomoea-batatas940x627.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [
			null,
			null,
			"Plant",
			"Plant",
			null,
			null,
			"Harvest",
			"Harvest"
		],
		"desc": "Sweet potatoes are widely grown in warmer climes and are gaining popularity in the UK, with the introduction of hardier cultivars.  They have attractive lush foliage, so are ornamental as well as edible, but they need a warm summer or extra protection, especially in cooler regions, to produce good tubers.  Sweet potatoes are rich in vitamin C and can be boiled, roasted or made into chips.  The shoots and leaves can be used like spinach.  Sweet potatoes like warmth and crop best at temperatures of 21–26°C (70–80°F), so are ideal for growing in a greenhouse, either in large tubs, growing bags or a greenhouse border.  Transplant them from their pots once they have plenty of roots.  The trailing stems can be trained up strings, canes or trellis to save space.  When growing in containers, any good-quality compost should be suitable, including peat-free. \n\nKeep plants well watered, and feed every other week with a high potassium liquid feed. \n Sweet potatoes can also be grown outdoors, especially in warmer regions.  But they are tender, so keep the young plants frost-free in a greenhouse or on a sunny windowsill until late May or early June, potting them on as they grow. \n\nChoose a warm, sheltered, sunny planting site with moisture-retentive, free-draining soil.  Sweet potatoes are vigorous plants with trailing stems reaching 1. 5m (5ft) or more, so they need plenty of space. \n\nTo prepare the ground, add lots of organic matter, such as garden compost.  Then in late March or April, several weeks before planting out, cover the area with black polythene to warm the soil and suppress weeds.  \n\nOnce all danger of frost has passed, harden off the plants by gradually acclimatising them to outdoor conditions.  Then plant them in slits through the polythene, at least 30cm (1ft) apart. \nCover the plants with cloches or fleece – the temperature lift makes all the difference.  Water regularly and feed fortnightly with a high potassium liquid feed. \n\nYou can also plant sweet potatoes in large containers, one per pot at least 30cm (1ft) wide, filled with multi-purpose compost.  Keep them in a warm, sunny, sheltered spot, and water and feed regularly. Sweet potatoes are usually grown from cuttings known as ‘slips’, which are available by mail order.  You can also take cuttings from shop-bought tubers, but they may not be suitable varieties for growing in the UK, so are less likely to be successful.  Alternatively, you can take cuttings from the tubers of plants overwintered in a frost-free greenhouse or windowsill. \n\nYoung sweet potato plants, grown from rooted cuttings, are also available via mail order in late spring or early summer. \n  You can buy unrooted cuttings or ‘slips’ of varieties suitable for the UK climate via mail order from late April onwards.  When they arrive, pot them up immediately into small pots of multi-purpose compost.  Keep the compost moist, using tepid water.  Cover the pots with a clear plastic bag or place them in an unheated propagator until they root.  It is possible to take cuttings from shop-bought tubers, but these may be less hardy cultivars that are unsuitable for the UK climate.  The tubers are often treated with an anti-sprouting agent too, so if you want to use them, scrub them clean first.  Then place the tubers in moist vermiculite, perlite or sand in a warm propagator or airing cupboard to encourage sprouting. To take cuttings from overwintered tubers or sprouted shop-bought tubers, remove the shoots with a sharp knife when they are 5–7. 5cm (2–3in) long.  Insert them into small pots filled with cuttings compost, then place in a warm propagator to root.   You can harvest sweet potatoes after four to five months, once the leaves turn yellow and die back in late summer or autumn, before any frosts. \n\nLift them carefully to avoid bruising the fresh tubers, which have delicate skin.  Any damaged tubers should be used straight away. \n\nSweet potatoes tubers can be boiled, roasted or made into chips.  They are best used fresh, as they are hard to store successfully.  They freeze well if blanched or boiled beforehand. \n\nThe shoots and leaves can also be cooked like spinach. Leaves become mottled, pale and covered in webbing, on which the mites can be clearly seen; leaves also drop prematurely. They thrive in hot, dry conditions, so mist plants regularly.  Use biological control in the greenhouse. Small white flies suck sap and excrete sticky ‘honeydew’ over the plant, encouraging the growth of sooty mould. Use biological control or sticky traps in the greenhouse"
	},
	{
		"name": "Sweetcorn",
		"imgUrl": "https://www.rhs.org.uk/getmedia/85aab220-0746-4fd4-96d2-7852c2f39113/Sweetcorn-in-the-Fruit-and-Vegetable-Competition-at-the-RHS-London-Harvest-Festival-Show-2012-_MAR0010664.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [
			null,
			null,
			null,
			"Sow",
			"Sow",
			"Harvest",
			"Harvest",
			"Harvest"
		],
		"desc": "Sweetcorn is delicious steamed then eaten simply with a knob of butter, fresh from the garden.  These tall plants also make a useful windbreak and an ornamental feature. Sweetcorn is most successful in long hot summers, although many modern cultivars are better suited to our cooler climate.  You can buy early, mid-season and late cultivars – in colder regions, early cultivars will do best. 'Supersweet' cultivars are much sweeter than the older varieties and retain their sweetness for longer, but are less vigorous.  Take care not to grow Supersweet plants next to other cultivars, as cross-pollination can result in poor flavour. \n\nAnother option is ‘Extra Tendersweet’ sweetcorn, which is almost as sweet and less chewy.  \n Sweetcorn needs warm conditions, so sow indoors at 18–21°C (65–70°F) from mid-April to early May.  Sow the large seeds in modules or deep pots at a depth of 2. 5cm (1in). \n\nFor an extended cropping season, try sowing early, mid-season and late cultivars at the same time, or sow one early cultivar another two times, three weeks apart. Sow outdoors in late spring, in the ground or in pots.  Make sure the soil temperature is above 10°C (50°F). \n\nAs sweetcorn is wind pollinated, plants should be grown in blocks rather than rows, 45cm (18in) apart.  Sow two or three seeds at each point, then thin out the extra seedlings to leave just the strongest one. Grow sweetcorn in a warm, sheltered, sunny position, protected from strong winds, and in fertile soil.  Plants are less successful on dry or heavy soil. \n\nPrepare the ground by digging in lots of garden compost or well-rotted manure.  Then rake in a high potassium general fertiliser, such as Vitax Q4, at a rate of three handfuls per square metre/yard. Sweetcorn is wind pollinated, so plant in blocks rather than rows, to maximise pollination.  Mulch the soil with garden compost to hold in moisture and suppress weeds, and mound soil over any roots that appear at the base of the stems.  Weed regularly, but hoe carefully as they’re shallow rooted. Stake plants individually if they are tall or are being rocked by strong winds. \n\nWater well in dry weather, especially when plants are flowering. \n\nTo aid pollination, tap the tops of the plants when the male flowers (tassels) open to help pollination of the female flowers below.  Poor pollination results in sparsely filled cobs. Sweetcorn cobs starts to ripen from mid-summer onwards.  Once the tassels at the end of a cob have turned chocolate brown, test for ripeness – peel back a little of the husk and pierce a kernel with your fingernail.  If a watery liquid squirts out, it’s not yet ripe, if the liquid is creamy, the cob is ready, but if it's paste-like then the cob is over-mature. \n\nTwist ripe cobs and pull sharply from the stem. \n\nOnce picked, sweetcorn rapidly loses its flavour, so only harvest when required and eat as soon as possible. These rodents will eat the seeds where plantedTrapping can be effective for mice in a garden situation, although voles can be harder to control.  Break-back traps of the type used against house mice can be effective when set in places where damage is occurring.  Pieces of carrot or dessert apple are effective baits for voles, and peanut butter for mice.  When using traps or baits out of doors, they must be placed under covers to reduce the risk of other animals interfering with them.  Birds are particularly vulnerable to accidental trapping. Birds, especially pigeons, can cause an array of problems including eating seedlings, buds, leaves, fruit and vegetables. Protect the plants from birds by covering them with netting or fleece.  Scarecrows and bird-scaring mechanisms work for a while, but the most reliable method of protection is to cover plants with horticultural fleece or mesh. These feed on the young seedlings and you'll see the tell tale slime trail on the soil around your crop, as well as on the leaves. There are many ways to control slugs and snails, including beer traps, sawdust or eggshell barriers, copper tape and biocontrols"
	},
	{
		"name": "Tomatoes",
		"imgUrl": "https://www.rhs.org.uk/getmedia/88c682f4-a291-47ee-a5cb-282bd75680ec/Tomkin-British-Tomato-Growers-Association-National-Plant-Societies-Plant-Heritage-Marquee-Tatton-Park-2012-_PUB0024696.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [
			null,
			"Sow",
			"Sow",
			"Sow",
			null,
			"Harvest",
			"Harvest",
			"Harvest"
		],
		"desc": "Growing your own tomatoes is simple and just a couple of plants will reward you with plenty of delicious tomatoes through the summer.  They’re ideal for growing in containers, either outdoors in a sunny spot or in a greenhouse, and there's a whole array to try, from tiny sweet cherry tomatoes to full-flavoured giant beefsteaks. Tomatoes generally have two ways of growing:\n\nCordon (or indeterminate) tomatoes grow tall, up to 1. 8m (6ft), and require tall supports.  They are great for growing in a greenhouse, but will also do well in a sunny spot outdoors, either in the ground or in large pots against a south-facing wall.  They are useful when space is limited, as plants grow vertically, tall and narrow, and produce a heavy crop.  They require regular maintenance – watering, feeding, tying to supports and pinching out side-shoots. \n\nBush (or determinate) tomatoes are shorter and wider, great for smaller gardens, pots and growing bags.  Smaller types can also be grown in hanging baskets, with the stems trailing over the sides.  These are the easiest type to grow and need little maintenance apart from watering and feeding.  The stems don’t usually need support, except if heavily laden with fruit.  \n\nCheck seed packets or plant labels before buying, to ensure you get the right type to suit your needs.  There are also lots of varieties to choose from, offering fruits of various sizes, shapes, flavours and textures.  Fruit colours range from traditional red to dark purple, pink, orange, yellow or green, and even striped.  There are heirloom varieties, grown for many generations, as well as modern, blight-resistant choices.  There are miniature round fruits, elongated plum varieties, smooth uniform salad tomatoes and huge, wrinkled, mis-shapen beefsteaks, all full of flavour and with their own individual characters. \n\nFor varieties that will reliably produce good crops, look for those with an RHS Award of Garden Merit (AGM), which means they performed well in RHS growing trials.  There are currently more than 40 AGM tomatoes to choose from – for a selection, see Recommended varieties, below. Tomato seeds are widely available from garden centres and other seed stockists. Tomatoes are easy to grow from seed sown indoors in warm conditions.  Sow from late February to mid-March if you’ll be growing your crop in a greenhouse, or from late March to early April if they’ll be outside.  \nFill a small pot with seed compost, water well, then sow three or four seeds on the surface.  Cover with vermiculite and keep at around 18°C (64°F), ideally in a heated propagator, or cover with a clear plastic bag and place on a warm windowsill.  As soon as seedlings appear – usually within a fortnight – uncover and place in as much light as possible, to prevent them growing thin and leggy.  After a couple of weeks, move the seedlings into individual pots: Keep the plants in a greenhouse or on a well-lit windowsill, where the temperature is always at least 16°C (60°F), and water regularly.  After about a month, they should be ready to plant into their final position, as soon as the first flowers open.  \n\nVegetable seeds: sowingWater tomato plants regularly to keep the soil or compost evenly moist.  Fluctuating moisture levels can cause problems with the fruit, such as splitting or blossom end rot (see Problem solving, below). \nPlants in containers dry out quickly, so they may need watering daily in hot weather. To boost fruiting, especially with plants in containers, feed every 10–14 days with a high potassium liquid fertiliser once the first fruits start to swell. Lay a thick layer of mulch over the soil around tomato plants to help hold moisture in the ground and deter weeds.  Use garden compost or well-rotted manure, but leave a gap around the base of the stem, to prevent rotting. When growing tomatoes in a greenhouse, open the vents regularly to give pollinating insects access to the flowers.  You can also lightly tap or shake the flowers when fully open to aid pollen transfer within the flower.  Misting flowers with water may also help. The two different types of tomatoes are treated differently – check your seed packet or plant label to see which type you are growing:\n\nCordon tomatoes are grown as tall, single-stemmed plants – they need tall supports and the side-shoots should be removed regularly. \n\nBush tomatoes are more compact and the side-shoots should not be removed.  They may or may not need support, depending on how large they grow and whether the stems are strong enough to carry their crop of fruit. \n\nFor advice on training and pruning tomatoes, see our video guide. Cordon tomatoes need support, usually either a tall sturdy cane or a vertical string coming down from an overhead horizontal support, such as a greenhouse roof, and anchored in the soil under the plant’s rootball.  However, tomatoes don’t cling to supports or twine round them naturally, so must be attached by hand as they grow.  If using a cane support, simply tie the main stem to it at regular intervals as it grows. \n\nIf using a vertical string, gently wind the string around the top of the main stem once or twice a week as it grows.  When plants reach the top of their support or have set seven fruit trusses indoors or four trusses outdoors, remove the growing point of the main stem at two leaves above the top truss. Cordon tomatoes are best grown as single-stemmed plants.  However, these vigorous plants naturally produce side-shoots from the joints where leaves sprout from the main stem.  These side-shoots should be pinched out to keep plants growing vertically on just one stem.  If they’re not removed, the side-shoots grow rapidly, forming a mass of long, scrambling, leafy stems that are difficult to support, produce few fruits and take up a lot of space.  Removing the side-shoots is simple – every time you water, check the plant for any shoots sprouting just above each leaf, from the joint between the leaf and the stem.  Pinch these out or snap them off.  Bush tomatoes are more compact and less vigorous than cordon tomatoes, and may not need supporting at all.  But if they carry a heavy crop of fruits, the side-shoots may start to droop or be at risk of snapping.  If so, simply add short vertical canes when required, tying in the shoots loosely to the cane. Tomatoes start to ripen from mid-summer onwards, depending on the variety, weather conditions and fruit size.  Smaller cherry tomatoes ripen more quickly than larger fruits, and greenhouse tomatoes usually start cropping earlier than those outdoors, and continue for longer, well into autumn.  \n\nCheck plants every few days and pick tomatoes individually, with the stalk still attached, as soon as they’re ripe and fully coloured. \n\nAt the end of the growing season, lift outdoor plants with unripe fruit and either lay them on straw under cloches or pick the fruits and place somewhere warm and dark to ripen.  Alternatively, put unripe tomatoes in a drawer with a banana, to aid ripening. Tomatoes are best eaten as fresh as possible.  But if you have too many, then fully ripe tomatoes can be kept in a fridge for a week or so, to prevent them going mouldy.  Try not to keep them refrigerated for long though, as the texture can deteriorate.  Bring them back to room temperature before eating, to enjoy the full flavour.  \nIf the tomatoes aren’t yet fully ripe, leave them unrefrigerated to reach their peak of ripeness. \nSurplus ripe tomatoes can also be cooked then frozen for use in pasta sauces, soups and stews. In a warm summer, tomatoes are easy to grow if they are well watered on a regular basis.  However, problems can occur when conditions are not ideal, includingDark blotches appear on the ends. Water regularly and not sporadically and never allow the soil to dry out. Disease that causes fruit and foliage rot, most common in wet weather. Select resistant cultivars. Leaf mould can develop rapidly to cause significant yield loss in greenhouse-grown tomatoes.  It is rarely seen on outdoor crops.  Yellow blotches develop on the upper leaf surface.  A pale, greyish-brown mould growth is found on the corresponding lower surface.  Where the disease is severe the mould growth may also be found on the upper surface. Select resistant cultivars.  Provide ample ventilation to indoor tomato crops. Cracking or splitting usually does not affect the taste of the tomato, but split fruit left on the plant will often be infected by a fungus, such as grey mould and can cause a variety of physiological disorders. Control temperature and sunlight levels carefully.  Feed regularly to maintain high soil fertility.  Water to maintain a constant level of soil moisture. Nigel Slater uses large, ripe tomatoes for his delicious supper dish roast tomatoes with cheese and thyme. Masterchef judge Gregg Wallace shares his recipe for tasty tomato tarts"
	},
	{
		"name": "Turnips",
		"imgUrl": "https://www.rhs.org.uk/getmedia/9bf0ae1e-f532-4cab-87c8-19c6eadaa3ff/Turnips_PUB0019241.jpg?width=940&height=627&ext=.jpg",
		"monthlyJob": [
			null,
			null,
			"Harvest",
			"Harvest",
			"Harvest",
			"Harvest",
			"Harvest",
			"Harvest"
		],
		"desc": "This easy, compact and fast-growing vegetable is best sown little and often for harvesting across the seasons.  The young roots are delicious raw, roasted or added to stews, and you can cook the leaves too, in a similar way to kale. Turnips are quick and easy to grow from seed, ready to harvest in as little as six to ten weeks.  They like cool, moisture-retentive soil, in an open, sunny location. \n\nYou can also sow in large containers outdoors, for harvesting when small, as baby veg. \n\nVarieties are divided into two main types, according to sowing and harvesting times:Early turnips – sow March to June, for harvesting throughout summerMaincrop turnips – sow July to mid-August, for harvesting in autumn and winter Some early varieties, such as ‘Atlantic’ and ‘Milan Purple Top’, can also be sown under cloches in February. \n\nSow seeds thinly in shallow drills, 1cm (½in) deep.  Space rows 23–30cm (9–12in) apart for early varieties, 30cm (1ft) apart for maincrops. \n\nWhen growing plants only to harvest their leaves (turnip tops or Italian cima di rapa), sow in August or September, spacing rows just 15cm (6in) apart. Thin out seedlings until they’re eventually 15cm (6in) apart for early varieties, and 23cm (9in) apart for maincrops.  When growing just for the leafy tops, thinning isn’t usually necessary. Water regularly, especially during dry weather, otherwise the roots will be small and woody.  Dry conditions can also cause plants to bolt (flower), which stops the root swelling. Early turnips: harvest from May to September when the size of a golf ball for eating raw, or the size of a tennis ball for cooking. Maincrop turnips: harvest from mid-October onwards, when the size of a golf ball. Turnip tops: harvest the leaves in March and April.  The plants will re-sprout, so you can make several pickings. White larvae approximately 5cm (2in) long, feed on the roots just below the soil surface, stunting growth and causing plants to wilt and die. Grow under insect-proof mesh or horticultural fleece.  Seedlings are most vulnerable. Leaves are covered in small holes and damaged areas turn brown.  Seedlings are particularly susceptible. Grow plants under horticultural fleece and keep the soil moist.  Water in nitrogen-rich fertilser to help the crop outgrow the pest. Appears as a white powdery deposit over the leaf surface and leaves become stunted and shrivel. Keep the soil moist and grow in cooler locations. Roots become swollen and distorted, and leaves become pale and yellow and wilt easily.  Plants may die. Improve drainage and add lime to make soil more alkaline.  Do not grow in affected soil"
	}
]
